nc: 80
scales:
  # [depth_mul, width_mul, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]

  # ── Stage 0: Stem ──
  - [-1, 1, Conv, [64, 3, 2]]

  # ── Stage 1 ──
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2_Prism, [128, False]]

  # ── Stage 2 ──
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2_Prism, [256, False]]

  # ── Stage 3 ──
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2_Prism, [512, False]]

  # ── Stage 4 ──
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2_Prism, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]

  # ✅ Thêm C2PSA ở cuối backbone
  - [-1, 2, C2PSA, [1024]]   # 10

head:
  # FPN
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11
  - [[-1, 6], 1, Concat, [1]]                   # 12
  - [-1, 2, PrismCSP, [512, False]]             # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14
  - [[-1, 4], 1, Concat, [1]]                   # 15
  - [-1, 2, PrismCSP, [256, False]]             # 16

  # PAN
  - [-1, 1, Conv, [256, 3, 2]]                  # 17
  - [[-1, 13], 1, Concat, [1]]                  # 18
  - [-1, 2, PrismCSP, [512, False]]             # 19

  - [-1, 1, Conv, [512, 3, 2]]                  # 20
  - [[-1, 9], 1, Concat, [1]]                   # 21
  - [-1, 2, PrismCSP, [1024, True]]             # 22

  # Detect
  - [[16, 19, 22], 1, Detect, [nc]]             # 23