
nc: 80
scales:
  # [depth_mul, width_mul, max_channels]
  n: [0.50, 0.25, 1024]    # Prism-n: ~1.1M params, edge deployment
  s: [0.50, 0.50, 1024]    # Prism-s: ~3.0M params, balanced
  m: [0.50, 1.00, 512]     # Prism-m: ~8.0M params, standard
  l: [1.00, 1.00, 512]     # Prism-l: ~14M params, accurate
  x: [1.00, 1.50, 512]     # Prism-x: ~23M params, maximum accuracy

backbone:
  # [from, repeats, module, args]

  # ── Stage 0: Stem ──
  - [-1, 1, Conv, [64, 3, 2]]                    # 0-P1/2   Standard stem Conv 3×3 stride 2

  # ── Stage 1: P1 → P2 ──
  - [-1, 1, Conv, [128, 3, 2]]                   # 1-P2/4   Downsample
  - [-1, 2, C3k2_Prism, [128, False]]            # 2-P2/4   Prism blocks ×2 (lo=5×5, hi=3×3+HP)

  # ── Stage 2: P2 → P3 (small objects) ──
  - [-1, 1, Conv, [256, 3, 2]]                   # 3-P3/8   Downsample
  - [-1, 2, C3k2_Prism, [256, False]]            # 4-P3/8   Prism blocks ×2

  # ── Stage 3: P3 → P4 (medium objects) ──
  - [-1, 1, Conv, [512, 3, 2]]                   # 5-P4/16  Downsample
  - [-1, 2, C3k2_Prism, [512, False]]            # 6-P4/16  Prism blocks ×2

  # ── Stage 4: P4 → P5 (large objects) ──
  - [-1, 1, Conv, [1024, 3, 2]]                  # 7-P5/32  Downsample
  - [-1, 2, C3k2_Prism, [1024, True]]            # 8-P5/32  Prism blocks ×2 (c3k=True → lo=7×7, hi=5×5+HP)

  - [-1, 1, SPPF, [1024, 5]]                     # 9-P5/32  Spatial Pyramid Pooling

head:
  # ════════════════════════ FPN: Top-Down Pathway ════════════════════════
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 10 Upsample P5→P4 size
  - [[-1, 6], 1, Concat, [1]]                         # 11 Concat with backbone P4
  - [-1, 2, PrismCSP, [512, False]]                   # 12 Prism fusion with FASR (P4)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 13 Upsample P4→P3 size
  - [[-1, 4], 1, Concat, [1]]                         # 14 Concat with backbone P3
  - [-1, 2, PrismCSP, [256, False]]                   # 15 Prism fusion with FASR (P3) — 3 repeats for small obj

  # ════════════════════════ PAN: Bottom-Up Pathway ════════════════════════
  - [-1, 1, Conv, [256, 3, 2]]                        # 16 Downsample P3→P4
  - [[-1, 12], 1, Concat, [1]]                        # 17 Concat with FPN P4
  - [-1, 2, PrismCSP, [512, False]]                   # 18 Prism fusion with FASR (P4)

  - [-1, 1, Conv, [512, 3, 2]]                        # 19 Downsample P4→P5
  - [[-1, 9], 1, Concat, [1]]                         # 20 Concat with backbone P5 (SPPF)
  - [-1, 2, PrismCSP, [1024, True]]                   # 21 Prism fusion with FASR (P5) — c3k=True

  # ════════════════════════ Detection Head ════════════════════════
  - [[15, 18, 21], 1, Detect, [nc]]                   # 22 Detect(P3, P4, P5)
