# Ultralytics YOLO 🚀, AGPL-3.0 license
# ═══════════════════════════════════════════════════════════════════════════
# YOLO-Prism V2 + EfficientNetV2 Hybrid
# ═══════════════════════════════════════════════════════════════════════════
#
# Backbone: EfficientNetV2 (FusedMBConv + MBConv) — proven efficient backbone
# Neck:     Prism V2 (PrismV2CSP with TriFreqConv + FreqContrastGate + AFR)
# Tail:     C2PSA for enhanced feature representation at P5
#
# Combines the parameter efficiency of EfficientNetV2 backbone
# with the tri-frequency awareness of Prism V2 neck.

nc: 80

scales:
  # [depth_mul, width_mul, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ═════════════════════ BACKBONE ═════════════════════
backbone:
  # [from, repeats, module, args]

  # ── Stem ──
  - [-1, 1, Conv, [64, 3, 2]]             # 0-P1/2
  # ── Stage 1 ──
  - [-1, 1, FusedMBConvV2, [64, 1, 1]]    # 1
  # ── Stage 2 → P2 ──
  - [-1, 2, FusedMBConvV2, [128, 2, 4]]   # 2-P2/4
  # ── Stage 3 → P3 ──
  - [-1, 2, FusedMBConvV2, [256, 2, 4]]   # 3-P3/8
  # ── Stage 4 → P4 ──
  - [-1, 3, MBConvV2, [512, 2, 4]]        # 4-P4/16
  # ── Stage 5 (refine P4) ──
  - [-1, 2, MBConvV2, [512, 1, 4]]        # 5-P4/16
  # ── Stage 6 → P5 ──
  - [-1, 2, MBConvV2, [1024, 2, 6]]       # 6-P5/32
  # ── SPPF ──
  - [-1, 1, SPPF, [1024, 5]]              # 7-P5/32
  # ── C2PSA (enhanced) ──
  - [-1, 2, C2PSA, [1024]]                # 8-P5/32

head:
  # ═════════ FPN (Top-down) with PrismV2CSP ═════════
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 9  P5 → P4
  - [[-1, 5], 1, Concat, [1]]                      # 10 concat P4 (layer 5)
  - [-1, 2, PrismV2CSP, [512, False]]              # 11 Tri-freq fusion (P4)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 12 P4 → P3
  - [[-1, 3], 1, Concat, [1]]                      # 13 concat P3 (layer 3)
  - [-1, 3, PrismV2CSP, [256, False]]              # 14 Tri-freq fusion (P3)

  # ═════════ PAN (Bottom-up) with PrismV2CSP ═════════
  - [-1, 1, Conv, [256, 3, 2]]                     # 15 P3 → P4
  - [[-1, 11], 1, Concat, [1]]                     # 16 concat FPN P4
  - [-1, 2, PrismV2CSP, [512, False]]              # 17 Tri-freq fusion (P4)

  - [-1, 1, Conv, [512, 3, 2]]                     # 18 P4 → P5
  - [[-1, 8], 1, Concat, [1]]                      # 19 concat C2PSA (layer 8)
  - [-1, 2, PrismV2CSP, [1024, True]]              # 20 Tri-freq fusion (P5), c3k=True

  # ═════════ Detect ═════════
  - [[14, 17, 20], 1, Detect, [nc]]                # 21 Detect(P3, P4, P5)
