# YOLOv13 🚀 - Next-Generation Object Detection Architecture
# Comprehensive high-efficiency design with:
# - Multi-Scale Adaptive Convolution (MSConv) 
# - Gated Channel Fusion Attention
# - Dynamic Spatial Fusion
# - Adaptive Downsampling (AdaptiveDown)
# - Enhanced SPPF with attention
# - Scale-Aware FPN neck

# Parameters
nc: 80 # number of classes
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]  # YOLOv13-nano
  s: [0.50, 0.50, 1024]  # YOLOv13-small
  m: [0.50, 1.00, 512]   # YOLOv13-medium
  l: [1.00, 1.00, 512]   # YOLOv13-large
  x: [1.00, 1.50, 512]   # YOLOv13-xlarge

# YOLOv13 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]           # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]          # 1-P2/4
  - [-1, 2, C3k2_YOLO13, [256, False, 0.25]]  # 2
  - [-1, 1, AdaptiveDown, [256]]         # 3-P3/8
  - [-1, 2, C3k2_YOLO13, [512, False, 0.25]]  # 4
  - [-1, 1, AdaptiveDown, [512]]         # 5-P4/16
  - [-1, 4, C3k2_YOLO13, [512, True, 0.5]]    # 6
  - [-1, 1, AdaptiveDown, [1024]]        # 7-P5/32
  - [-1, 4, C3k2_YOLO13, [1024, True, 0.5]]   # 8
  - [-1, 1, EnhancedSPPF, [1024, 5]]    # 9

# YOLOv13 head with Scale-Aware FPN
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]           # cat backbone P4
  - [-1, 2, YOLO13CSP, [512, False]]    # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]]           # cat backbone P3
  - [-1, 2, YOLO13CSP, [256, False]]    # 15

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]          # cat head P4
  - [-1, 2, YOLO13CSP, [512, False]]    # 18

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]           # cat head P5
  - [-1, 2, C3k2_YOLO13, [1024, True]]  # 21

  - [[15, 18, 21], 1, Detect, [nc]]     # Detect(P3, P4, P5)
