# Ultralytics YOLO 🚀 — YOLO-X-BEYOND (XBN)
# =========================================================================
# Backbone : Conv stem + DMC_Block (Dynamic Morphological Convolution)
# P5 global: MSSO (Möbius-Selective State Operator) — thay SPPF + C2PSA
# Neck     : RXG_Fuse (Recursive Cross-Scale Gating + IB-Route weights)
# Head     : Detect (T-LDH orthogonal projector sẽ được bật ở patch head riêng)
#
# Target operating point: XBN-M ~ YOLO11-M FLOPs/Params, mAP vượt YOLO11-L.

nc: 80
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.67, 0.75, 768]     # target cho báo cáo Pareto
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,      [64, 3, 2]]      # 0  P1/2 stem
  - [-1, 1, DMC_Block, [64, 1]]         # 1
  - [-1, 2, DMC_Block, [128, 2]]        # 2  P2/4
  - [-1, 2, DMC_Block, [256, 2]]        # 3  P3/8   <- neck skip
  - [-1, 3, DMC_Block, [512, 2]]        # 4  P4/16  <- neck skip
  - [-1, 2, DMC_Block, [512, 1]]        # 5  deeper P4
  - [-1, 2, DMC_Block, [1024, 2]]       # 6  P5/32
  - [-1, 1, MSSO,      [1024]]          # 7  global context (replaces SPPF+C2PSA)

head:
  # ---------------- top-down (FPN) với RXG ----------------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 8
  - [[-1, 5], 1, RXG_Fuse, [512]]                   # 9  fuse(up_P5, backbone_P4_deep)
  - [-1, 2, C3k2, [512, False]]                     # 10

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]      # 11
  - [[-1, 3], 1, RXG_Fuse, [256]]                   # 12 fuse(up_P4, backbone_P3)
  - [-1, 2, C3k2, [256, False]]                     # 13  ← P3 out

  # ---------------- bottom-up (PAN) với RXG ----------------
  - [-1, 1, Conv, [256, 3, 2]]                      # 14 down P3 → /16
  - [[-1, 10, 4], 1, RXG_Fuse, [512]]               # 15 TRI-input (PAN+topdown+skip)
  - [-1, 2, C3k2, [512, False]]                     # 16  ← P4 out

  - [-1, 1, Conv, [512, 3, 2]]                      # 17 down P4 → /32
  - [[-1, 7], 1, RXG_Fuse, [1024]]                  # 18 fuse(PAN_P5, MSSO_P5)
  - [-1, 2, C3k2, [1024, True]]                     # 19  ← P5 out

  - [[13, 16, 19], 1, Detect, [nc]]                 # 20 Detect(P3, P4, P5)
