# Ultralytics YOLO 🚀 — YOLO-Transcendent-Lite
# =========================================================================
# Mục tiêu: PHIÊN BẢN NHẸ NHẤT, ưu tiên tốc độ inference.
# Khác với Transcendent base:
#   - Backbone MobileNetV4 (MNV4Conv/MNV4UIB) thay Prism tri-freq (rẻ hơn ~30%)
#   - MSSO giảm: d_state=4, expand=1.0, heads=2 (chi phí scan thấp)
#   - Neck: LiteFusion thay RXG_Fuse (1 block nhẹ, không second-step contraction)
#   - Bỏ AdaptiveFreqRefine (tiết kiệm 3 layer)
#   - Bottom-up dùng C3k2 chuẩn (e=0.25) → rất gọn
#
# Target: yolo11n-scale FLOPs, >200 FPS trên RTX 3060.

nc: 80
scales:
  n: [0.50, 0.25, 1024]    # < 3 GFLOPs
  s: [0.50, 0.50, 1024]
  m: [0.50, 0.75, 768]
  l: [1.00, 1.00, 512]

backbone:
  - [-1, 1, Conv,      [64, 3, 2]]        # 0  P1/2
  - [-1, 1, MNV4Conv,  [64, 1, 1]]        # 1
  - [-1, 2, MNV4Conv,  [128, 2, 2]]       # 2  P2/4
  - [-1, 2, MNV4Conv,  [256, 2, 2]]       # 3  P3/8
  - [-1, 2, MNV4UIB,   [512, 2, 2]]       # 4  P4/16
  - [-1, 2, MNV4UIB,   [512, 1, 2]]       # 5  deeper P4
  - [-1, 2, MNV4UIB,   [1024, 2, 3]]      # 6  P5/32
  - [-1, 1, MSSO,      [1024, 4, 1.0, 2]] # 7  thay SPPF — d_state=4 (lite)

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 8
  - [[-1, 5], 1, LiteFusion, [512]]               # 9
  - [-1, 2, C3k2, [512, False, 0.25]]             # 10

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 11
  - [[-1, 3], 1, LiteFusion, [256]]               # 12
  - [-1, 2, C3k2, [256, False, 0.25]]             # 13 ← P3 out

  - [-1, 1, Conv, [256, 3, 2]]                    # 14
  - [[-1, 10], 1, LiteFusion, [512]]              # 15
  - [-1, 2, C3k2, [512, False, 0.25]]             # 16 ← P4 out

  - [-1, 1, Conv, [512, 3, 2]]                    # 17
  - [[-1, 7], 1, LiteFusion, [1024]]              # 18
  - [-1, 2, C3k2, [1024, True, 0.25]]             # 19 ← P5 out

  - [[13, 16, 19], 1, Detect, [nc]]               # 20
