# Ultralytics YOLO 🚀 — YOLO-Transcendent
# =========================================================================
# Tái tổ hợp (KHÔNG viết module mới):
#   - Backbone: Prism-v2 tri-band freq (C3k2_PrismV2) — giữ ưu thế texture-aware
#   - P5 global: MSSO (Möbius-Selective State Operator) thay SPPF
#   - Neck:
#       * AdaptiveFreqRefine cho từng scale (P3 nhấn edge, P5 nhấn context)
#       * RXG_Fuse (IB-Route + 2-step contraction) thay Concat ở mọi chỗ fusion
#       * PrismV2CSP cho top-down (tri-freq refine), C3k2 cho bottom-up (tốc độ)
#   - Nhánh PAN dùng 3-input RXG (bi-directional BiFPN thu gọn)
#
# Mục tiêu: Pareto-dominate Prism-v5 — mAP cao hơn, FLOPs +<5%.

nc: 80

scales:
  # [depth_mul, width_mul, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.67, 0.75, 768]     # target chính cho báo cáo Pareto
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,            [64, 3, 2]]          # 0  P1/2 stem
  - [-1, 1, Conv,            [128, 3, 2]]         # 1  P2/4 down
  - [-1, 1, C3k2,            [128, False, 0.25]]  # 2  P2/4 standard (resolution cao)
  - [-1, 1, Conv,            [256, 3, 2]]         # 3  P3/8 down
  - [-1, 2, C3k2_PrismV2,    [256, False]]        # 4  P3/8 tri-freq  ← neck skip
  - [-1, 1, Conv,            [512, 3, 2]]         # 5  P4/16 down
  - [-1, 2, C3k2_PrismV2,    [512, False]]        # 6  P4/16 tri-freq ← neck skip
  - [-1, 1, Conv,            [1024, 3, 2]]        # 7  P5/32 down
  - [-1, 2, C3k2_PrismV2,    [1024, True]]        # 8  P5/32 large kernels
  - [-1, 1, MSSO,            [1024]]              # 9  ← thay SPPF, global context O(N)

head:
  # ── Frequency refinement per-scale trước khi fusion ──
  - [4, 1, AdaptiveFreqRefine, []]                # 10 refine P3 (nhấn edge)
  - [6, 1, AdaptiveFreqRefine, []]                # 11 refine P4 (balance)
  - [9, 1, AdaptiveFreqRefine, []]                # 12 refine P5 (nhấn context)

  # ── FPN top-down với RXG_Fuse ──
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 13 up P5 → /16
  - [[-1, 11], 1, RXG_Fuse, [512]]                # 14 fuse(up_P5, P4_refined)
  - [-1, 2, PrismV2CSP, [512, False]]             # 15 tri-freq refine P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]    # 16 up P4 → /8
  - [[-1, 10], 1, RXG_Fuse, [256]]                # 17 fuse(up_P4, P3_refined)
  - [-1, 2, PrismV2CSP, [256, False]]             # 18 tri-freq refine P3 ← P3 out

  # ── PAN bottom-up với RXG_Fuse (tri-input bi-directional) ──
  - [-1, 1, Conv, [256, 3, 2]]                    # 19 down P3 → /16
  - [[-1, 15, 11], 1, RXG_Fuse, [512]]            # 20 TRI-input: PAN + topdown + skip
  - [-1, 2, C3k2, [512, False]]                   # 21 ← P4 out (C3k2 chuẩn cho tốc độ)

  - [-1, 1, Conv, [512, 3, 2]]                    # 22 down P4 → /32
  - [[-1, 12], 1, RXG_Fuse, [1024]]               # 23 fuse(PAN_P5, MSSO_refined)
  - [-1, 2, C3k2, [1024, True]]                   # 24 ← P5 out

  # ── Detection head ──
  - [[18, 21, 24], 1, Detect, [nc]]               # 25 Detect(P3, P4, P5)
