# Ultralytics YOLO 🚀 — YOLO-Transcendent-Pro
# =========================================================================
# Mục tiêu: BIẾN THỂ CHÍNH XÁC NHẤT. Không ưu tiên tốc độ.
# Khác với Transcendent base:
#   - Backbone hybrid: Prism-v2 ở P3/P4 + DMC_Block (tropical+linear) ở P5
#     → DMC_Block xử lý boundary/silhouette tốt hơn C3k2 ở semantic cao
#   - MSSO tăng: d_state=16, expand=2.0, heads=4 → global context mạnh
#   - Neck: RXG_Fuse ở mọi chỗ + PrismV2CSP cả top-down lẫn bottom-up
#   - Thêm lớp AdaptiveFreqRefine sau cả refine block (frequency polish)
#   - Dual fusion ở P4: 4-input RXG (PAN + topdown + skip-P4-deep + skip-P4-shallow)

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]    # target Pro
  x: [1.33, 1.25, 512]

backbone:
  - [-1, 1, Conv,            [64, 3, 2]]           # 0  P1/2
  - [-1, 1, Conv,            [128, 3, 2]]          # 1  P2/4
  - [-1, 1, C3k2_PrismV2,    [128, False]]         # 2  P2/4 tri-freq
  - [-1, 1, Conv,            [256, 3, 2]]          # 3  P3/8
  - [-1, 3, C3k2_PrismV2,    [256, False]]         # 4  P3/8 tri-freq (deep)
  - [-1, 1, Conv,            [512, 3, 2]]          # 5  P4/16
  - [-1, 3, C3k2_PrismV2,    [512, False]]         # 6  P4/16 tri-freq (deep)
  - [-1, 1, DMC_Block,       [512, 1]]             # 7  P4/16 tropical refine (boundary)
  - [-1, 1, Conv,            [1024, 3, 2]]         # 8  P5/32
  - [-1, 3, C3k2_PrismV2,    [1024, True]]         # 9  P5/32 large kernels
  - [-1, 1, DMC_Block,       [1024, 1]]            # 10 P5 morphology
  - [-1, 1, MSSO,            [1024, 16, 2.0, 4]]   # 11 heavy MSSO (d_state=16, heads=4)

head:
  # Frequency refine từng scale
  - [4, 1, AdaptiveFreqRefine, []]                 # 12 P3
  - [7, 1, AdaptiveFreqRefine, []]                 # 13 P4 (sau DMC)
  - [11, 1, AdaptiveFreqRefine, []]                # 14 P5 (sau MSSO)

  # FPN top-down RXG + PrismV2CSP
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 15 up P5
  - [[-1, 13], 1, RXG_Fuse, [512]]                 # 16
  - [-1, 3, PrismV2CSP, [512, False]]              # 17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 18 up P4
  - [[-1, 12], 1, RXG_Fuse, [256]]                 # 19
  - [-1, 3, PrismV2CSP, [256, False]]              # 20 ← P3 out

  # PAN bottom-up với 4-input fusion ở P4 (dense skip)
  - [-1, 1, Conv, [256, 3, 2]]                     # 21 down P3
  - [[-1, 17, 13, 6], 1, RXG_Fuse, [512]]          # 22 QUAD-input (PAN+topdown+P4_refined+P4_backbone_deep)
  - [-1, 3, PrismV2CSP, [512, False]]              # 23 ← P4 out

  - [-1, 1, Conv, [512, 3, 2]]                     # 24 down P4
  - [[-1, 14, 11], 1, RXG_Fuse, [1024]]            # 25 tri-input (PAN+P5_refined+MSSO)
  - [-1, 3, PrismV2CSP, [1024, True]]              # 26 ← P5 out

  - [[20, 23, 26], 1, Detect, [nc]]                # 27 Detect(P3,P4,P5)
