# Ultralytics YOLO 🚀, AGPL-3.0 license
# ═══════════════════════════════════════════════════════════════════════════
# YOLO-Chimera: Multi-Dilation Hybrid Detection with Spectral Intelligence
# ═══════════════════════════════════════════════════════════════════════════
#
# Novel architecture with THREE original innovations:
#
#   1. Backbone: C3k2_Chimera (TridentConv + SpectralGate)
#      → Triple-dilation DWConv (d=1,2,4) processes ALL channels at 3 scales
#      → Same 3×3 kernel → effective RF of 3, 5, 9 simultaneously
#      → SpectralGate: mean + stddev channel attention (novel statistic)
#      → Channel shuffle mixes inter-dilation information
#
#   2. Neck: ChimeraCSP (ChimeraBottleneck + CrossScaleModulator)
#      → ChimeraBottleneck: same triple-dilation + spectral backbone quality
#      → CrossScaleModulator (CSM): content-gated spatial attention
#        AvgPool(2×2) → Conv1×1 → Upsample → Sigmoid gates DWConv detail
#      → Multi-scale context drives spatial focus (unique to Chimera)
#
#   3. Head: Standard Detect (P3, P4, P5) — proven anchor-free detection
#
# Key advantages vs existing architectures:
#
#   vs YOLO11:
#   - 20-40% fewer parameters (DWConv-based, no heavy standard convs)
#   - Triple-scale features at every layer (standard YOLO has single scale)
#   - Channel + Spatial attention (YOLO11 has none in C3k2)
#
#   vs YOLO-Phoenix:
#   - 3 RF scales vs 2 (TridentConv d=1,2,4 vs HeteroConv k=3,5)
#   - Novel stddev attention vs max-pool attention
#   - Content-gated neck vs local-only SRM
#   - Slightly fewer params (divisible-by-3 TridentConv is efficient)
#
#   vs YOLO-EDGE:
#   - Processes ALL channels (EDGE/PConv uses only 25%)
#   - Has dual attention: spectral (channel) + CSM (spatial)
#   - Triple-scale RF vs single-scale PConv
#
# Hardware: Fully ONNX/TensorRT compatible (DWConv + 1×1 Conv, no exotic ops)
# Scaling: n/s/m/l/x via standard YOLO scaling system

nc: 80
scales:
  # [depth_mul, width_mul, max_channels]
  n: [0.50, 0.25, 1024]    # Chimera-n: ~1.3M params, edge deployment
  s: [0.50, 0.50, 1024]    # Chimera-s: ~3.5M params, balanced
  m: [0.50, 1.00, 512]     # Chimera-m: ~9M params, standard
  l: [1.00, 1.00, 512]     # Chimera-l: ~16M params, accurate
  x: [1.00, 1.50, 512]     # Chimera-x: ~26M params, maximum accuracy

backbone:
  # [from, repeats, module, args]

  # ── Stage 0: Stem ──
  - [-1, 1, Conv, [64, 3, 2]]                    # 0-P1/2   Standard stem Conv 3×3 stride 2

  # ── Stage 1: P1 → P2 ──
  - [-1, 1, Conv, [128, 3, 2]]                   # 1-P2/4   Downsample
  - [-1, 2, C3k2_Chimera, [128, False]]          # 2-P2/4   Chimera blocks ×2 (d=1,2,4 TridentConv)

  # ── Stage 2: P2 → P3 (small objects) ──
  - [-1, 1, Conv, [256, 3, 2]]                   # 3-P3/8   Downsample
  - [-1, 2, C3k2_Chimera, [256, False]]          # 4-P3/8   Chimera blocks ×2

  # ── Stage 3: P3 → P4 (medium objects) ──
  - [-1, 1, Conv, [512, 3, 2]]                   # 5-P4/16  Downsample
  - [-1, 2, C3k2_Chimera, [512, False]]          # 6-P4/16  Chimera blocks ×2

  # ── Stage 4: P4 → P5 (large objects) ──
  - [-1, 1, Conv, [1024, 3, 2]]                  # 7-P5/32  Downsample
  - [-1, 2, C3k2_Chimera, [1024, True]]          # 8-P5/32  Chimera blocks ×2 (c3k=True → 5×5 base, d=1,2,4)
  - [-1, 1, SPPF, [1024, 5]]                     # 9-P5/32  Spatial Pyramid Pooling

head:
  # ════════════════════════ FPN: Top-Down Pathway ════════════════════════
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 10 Upsample P5→P4 size
  - [[-1, 6], 1, Concat, [1]]                         # 11 Concat with backbone P4
  - [-1, 2, ChimeraCSP, [512, False]]                 # 12 Chimera fusion with CSM (P4)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 13 Upsample P4→P3 size
  - [[-1, 4], 1, Concat, [1]]                         # 14 Concat with backbone P3
  - [-1, 3, ChimeraCSP, [256, False]]                 # 15 Chimera fusion with CSM (P3) — 3 repeats for small obj

  # ════════════════════════ PAN: Bottom-Up Pathway ════════════════════════
  - [-1, 1, Conv, [256, 3, 2]]                        # 16 Downsample P3→P4
  - [[-1, 12], 1, Concat, [1]]                        # 17 Concat with FPN P4
  - [-1, 2, ChimeraCSP, [512, False]]                 # 18 Chimera fusion with CSM (P4)

  - [-1, 1, Conv, [512, 3, 2]]                        # 19 Downsample P4→P5
  - [[-1, 9], 1, Concat, [1]]                         # 20 Concat with backbone P5 (SPPF)
  - [-1, 2, ChimeraCSP, [1024, True]]                 # 21 Chimera fusion with CSM (P5) — c3k=True

  # ════════════════════════ Detection Head ════════════════════════
  - [[15, 18, 21], 1, Detect, [nc]]                   # 22 Detect(P3, P4, P5)
