# YOLO11 + EfficientNetV2 Pro Backbone + C2PSA + C3k2_DCNF_V4 + CBAM
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, FusedMBConv, [64, 1, 1]]   # 1-P1/2
  - [-1, 2, FusedMBConv, [128, 2, 4]]  # 2-P2/4
  - [-1, 2, FusedMBConv, [256, 2, 4]]  # 3-P3/8
  - [-1, 2, MBConv, [512, 2, 4]]       # 4-P4/16 (Giảm từ 3 xuống 2)
  - [-1, 1, MBConv, [512, 1, 4]]       # 5-P4/16
  - [-1, 2, MBConv, [1024, 2, 4]]      # 6-P5/32 (Hạ expansion xuống 4 để giảm tải)
  - [-1, 1, SPPF, [1024, 5]]           # 7-P5/32
  - [-1, 1, C2PSA, [1024]]             # 8-P5/32 (Giảm từ 2 xuống 1 để tối ưu latency)

head:
  # -------- Top-down pathway --------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 9
  - [[-1, 5], 1, Concat, [1]]                   # 10
  - [-1, 2, C3k2_DCNF_V4, [512, False]]         # 11
  - [-1, 1, CBAM, [512]]                        # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13
  - [[-1, 3], 1, Concat, [1]]                   # 14
  - [-1, 3, C3k2_DCNF_V4, [256, False]]         # 15
  - [-1, 1, CBAM, [256]]                        # 16

  # -------- Bottom-up pathway --------
  - [-1, 1, Conv, [256, 3, 2]]                  # 17
  - [[-1, 12], 1, Concat, [1]]                  # 18
  - [-1, 2, C3k2_DCNF_V4, [512, False]]         # 19
  - [-1, 1, CBAM, [512]]                        # 20

  - [-1, 1, Conv, [512, 3, 2]]                  # 21
  - [[-1, 8], 1, Concat, [1]]                   # 22 (Nối trực tiếp với output của C2PSA)
  - [-1, 2, C3k2_DCNF_V4, [1024, True]]         # 23

  # Detect
  - [[16, 20, 23], 1, Detect, [nc]]             # 24