nc: 80
scales:
  n: [0.50, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  # ===== Stem =====
  - [-1, 1, Conv, [64, 3, 2]]          # 0
  # ===== Stage 1 =====
  - [-1, 1, FusedMBConv, [64, 1, 1]]   # 1
  # ===== Stage 2 =====
  - [-1, 2, FusedMBConv, [128, 2, 4]]  # 2
  # ===== Stage 3 (P3) =====
  - [-1, 2, FusedMBConv, [256, 2, 4]]  # 3
  # ===== Stage 4 (P4) =====
  - [-1, 3, MBConv, [512, 2, 4]]       # 4
  # ===== Stage 5 =====
  - [-1, 2, MBConv, [512, 1, 4]]       # 5
  # ===== Stage 6 (P5) =====
  - [-1, 2, MBConv, [1024, 2, 5]]      # 6
  # ===== SPPF =====
  - [-1, 1, SPPF, [1024, 5]]           # 7
  # ===== C2PSA (NEW) =====
  - [-1, 2, C2PSA, [1024]]             # 8


head:
  # ===== Top-down =====
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 9
  - [[-1, 5], 1, Concat, [1]]                    # 10
  - [-1, 2, C3k2_CBAM, [512, False]]             # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 3], 1, Concat, [1]]                    # 13
  - [-1, 3, C3k2_CBAM, [256, False]]             # 14

  # ===== Bottom-up =====
  - [-1, 1, Conv, [256, 3, 2]]                   # 15
  - [[-1, 11], 1, Concat, [1]]                   # 16
  - [-1, 3, C3k2, [512, False]]             # 17

  - [-1, 1, Conv, [512, 3, 2]]                   # 18
  - [[-1, 8], 1, Concat, [1]]                    # 19
  - [-1, 2, C3k2, [1024, True]]                  # 20


  # ===== Detect =====
  - [[14, 17, 20], 1, Detect, [nc]]              # 21