nc: 80
scales:
  # Sử dụng scale n của YOLO11: depth_multiple=0.5, width_multiple=0.25
  n: [0.50, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  # Stage 0: Stem
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  # Stage 1: Fused-MBConv (L=2)
  - [-1, 1, FusedMBConv, [64, 1, 1]]   # 1-P1/2
  # Stage 2: Fused-MBConv (L=4)
  - [-1, 2, FusedMBConv, [128, 2, 4]]  # 2-P2/4
  # Stage 3: Fused-MBConv (L=4) -> Kết nối P3
  - [-1, 2, FusedMBConv, [256, 2, 4]]  # 3-P3/8
  # Stage 4: MBConv (L=6) -> Kết nối P4
  - [-1, 3, MBConv, [512, 2, 4]]       # 4-P4/16
  # Stage 5: MBConv (L=9, stride 1)
  - [-1, 2, MBConv, [512, 1, 4]]       # 5-P4/16
  # Stage 6: MBConv (L=15) -> Kết nối P5
  - [-1, 2, MBConv, [1024, 2, 5]]      # 6-P5/32
  # Thành phần bổ trợ cho YOLO11 (Bỏ C2PSA, giữ SPPF)
  - [-1, 1, SPPF, [1024, 5]]           # 7-P5/32

head:
  # -------- Top-down pathway --------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 8 (P4/16)
  - [[-1, 5], 1, Concat, [1]]                   # 9 cat backbone P4 (Layer 5)
  - [-1, 2, C3k2, [512, False]]            # 10 (P4-medium)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11 (P3/8)
  - [[-1, 3], 1, Concat, [1]]                   # 12 cat backbone P3 (Layer 3)
  - [-1, 3, C3k2, [256, False]]            # 13 (P3-small)

  # -------- Bottom-up pathway --------
  - [-1, 1, Conv, [256, 3, 2]]                  # 14 (P4/16)
  - [[-1, 10], 1, Concat, [1]]                  # 15 cat head P4 (Layer 10)
  - [-1, 2, C3k2, [512, False]]            # 16 (P4-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 17 (P5/32)
  - [[-1, 7], 1, Concat, [1]]                   # 18 cat backbone P5 (Layer 7 - SPPF)
  - [-1, 2, C3k2, [1024, True]]                 # 19 (P5-large)

  # Detect lấy đầu ra từ các lớp P3, P4, P5
  - [[13, 16, 19], 1, Detect, [nc]]             # 20 Detect(P3, P4, P5)