nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, FusedMBConv, [64, 1, 1]]   # 1-P1/2
  - [-1, 2, FusedMBConv, [128, 2, 4]]  # 2-P2/4
  - [-1, 2, FusedMBConv, [256, 2, 4]]  # 3-P3/8
  - [-1, 3, MBConv, [512, 2, 4]]       # 4-P4/16
  - [-1, 2, MBConv, [512, 1, 4]]       # 5-P4/16
  - [-1, 2, MBConv, [1024, 2, 5]]      # 6-P5/32
  - [-1, 1, SPPF, [1024, 5]]           # 7-P5/32

head:
  # -------- Top-down pathway --------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 8 (P4/16)
  - [[-1, 5], 1, Concat, [1]]                   # 9 cat backbone P4
  - [-1, 2, C3k2_DCNF, [512, False]]            # 10 (P4-medium)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11 (P3/8)
  - [[-1, 3], 1, Concat, [1]]                   # 12 cat backbone P3
  - [-1, 3, C3k2_DCNF, [256, False]]            # 13 (P3-small)

  # Trích xuất đặc trưng P2-micro (Không đưa ra Detect)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 14 (P2/4)
  - [[-1, 2], 1, Concat, [1]]                   # 15 cat backbone P2 (Layer 2)
  - [-1, 3, C3k2_DCNF, [128, False]]            # 16 (P2-micro) -> Chỉ dùng làm feature extractor

  # -------- Bottom-up pathway --------
  - [-1, 1, Conv, [128, 3, 2]]                  # 17 từ P2 đi lên P3
  - [[-1, 13], 1, Concat, [1]]                  # 18 cat head P3
  - [-1, 3, C3k2_DCNF, [256, False]]            # 19 (P3-small) -> Đầu ra 1 (Đã hấp thụ P2)

  - [-1, 1, Conv, [256, 3, 2]]                  # 20 từ P3 đi lên P4
  - [[-1, 10], 1, Concat, [1]]                  # 21 cat head P4
  - [-1, 2, C3k2_DCNF, [512, False]]            # 22 (P4-medium) -> Đầu ra 2

  - [-1, 1, Conv, [512, 3, 2]]                  # 23 từ P4 đi lên P5
  - [[-1, 7], 1, Concat, [1]]                   # 24 cat backbone P5
  - [-1, 2, C3k2_DCNF, [1024, True]]            # 25 (P5-large) -> Đầu ra 3

  # Detect CHỈ lấy 3 đầu ra: P3, P4, P5 để tối ưu FLOPs
  - [[19, 22, 25], 1, Detect, [nc]]             # 26 Detect(P3, P4, P5)