# YOLO11 + EfficientNetV2 Pro Backbone + C3k2_DCNF_V4 + CBAM
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]          # 0-P1/2
  - [-1, 1, FusedMBConv, [64, 1, 1]]   # 1-P1/2
  - [-1, 2, FusedMBConv, [128, 2, 4]]  # 2-P2/4
  - [-1, 2, FusedMBConv, [256, 2, 4]]  # 3-P3/8
  - [-1, 3, MBConv, [512, 2, 4]]       # 4-P4/16
  - [-1, 1, MBConv, [512, 1, 4]]       # 5-P4/16
  - [-1, 2, MBConv, [1024, 2, 5]]      # 6-P5/32
  - [-1, 1, SPPF, [1024, 5]]           # 7-P5/32
  - [-1, 2, C2PSA, [1024]]             # 8-P5/32

head:
  # -------- Top-down pathway --------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 8 (P4/16)
  - [[-1, 5], 1, Concat, [1]]                   # 9
  - [-1, 2, C3k2_DCNF_V4, [512, False]]         # 10 (P4-medium)
  - [-1, 1, CBAM, [512]]                        # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12 (P3/8)
  - [[-1, 3], 1, Concat, [1]]                   # 13
  - [-1, 3, C3k2_DCNF_V4, [256, False]]         # 14 (P3-small)
  - [-1, 1, CBAM, [256]]                        # 15

  # -------- Bottom-up pathway --------
  - [-1, 1, Conv, [256, 3, 2]]                  # 16 (P4/16)
  - [[-1, 11], 1, Concat, [1]]                  # 17 (Nối với đầu ra CBAM layer 11)
  - [-1, 2, C3k2_DCNF_V4, [512, False]]         # 18
  - [-1, 1, CBAM, [512]]                        # 19

  - [-1, 1, Conv, [512, 3, 2]]                  # 20 (P5/32)
  - [[-1, 7], 1, Concat, [1]]                   # 21 (Nối với SPPF)
  - [-1, 2, C3k2_DCNF_V4, [1024, True]]         # 22 (P5-large)

  # Detect
  - [[15, 19, 22], 1, Detect, [nc]]             # 23 Detect(P3, P4, P5)