# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs and CBAM attention.

# Parameters
nc: 80
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ---------------------------
# Backbone
# ---------------------------
backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1 - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3 - P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]         # 5 - P4/16
  - [-1, 2, C3k2, [512, True]]         # 6
  - [-1, 1, Conv, [1024, 3, 2]]        # 7 - P5/32
  - [-1, 2, C3k2, [1024, True]]        # 8
  - [-1, 1, SPPF, [1024, 5]]           # 9
  - [-1, 2, C2PSA, [1024]]             # 10 - End of backbone

# ---------------------------
# Head (P3, P4, P5)
# ---------------------------
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, Concat, [1]]                  # 12: up(P5) + P4 (index 6)
  - [-1, 2, C3k2, [512, False]]                # 13: P4 head
  - [ -1, 1, EMA, [512, 8]]                    # 14: SimAM on P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, Concat, [1]]                  # 16: up(P4) + P3 (index 4)
  - [-1, 2, C3k2, [256, False]]                # 17: P3 head (P3/8-small)
  - [-1, 1, EMA, [256, 8]]                    # 18: SimAM on P3 -> First Detect Input

  - [-1, 1, Conv, [256, 3, 2]]                 # 19: down to P4 scale
  - [[-1, 14], 1, Concat, [1]]                 # 20: + P4 head feat (from CBAM at index 14)
  - [-1, 2, C3k2, [512, False]]                # 21: P4 head (P4/16-medium) -> Second Detect Input

  - [-1, 1, Conv, [512, 3, 2]]                 # 22: down to P5 scale
  - [[-1, 10], 1, Concat, [1]]                 # 23: + P5 bottleneck (from backbone index 10)
  - [-1, 2, C3k2, [1024, True]]                # 24: P5 head (P5/32-large) -> Third Detect Input

  - [[18, 21, 24], 1, Detect, [nc]]            # 25: Detect(P3, P4, P5)