# YOLOv12-BiFPN-Fixed-Final 🚀

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12 Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv,  [64, 3, 2]] # 0
  - [-1, 1, Conv,  [128, 3, 2, 1, 2]] # 1
  - [-1, 1, CoordAtt, [128]] # 2
  - [-1, 2, C3k2,  [256, False, 0.25]]
  - [-1, 1, Conv,  [256, 3, 2, 1, 4]] # 4
  - [-1, 1, CoordAtt, [256]] # 5
  - [-1, 2, C3k2,  [512, False, 0.25]]
  - [-1, 1, Conv,  [512, 3, 2]] # 7
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, CoordAtt, [512]] # 9
  - [-1, 1, Conv,  [1024, 3, 2]] # 10
  - [-1, 4, A2C2f, [1024, True, 1]] # 11
  - [-1, 1, CoordAtt, [1024]] # 12

# Head
head:
  # === Top-down ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  # BiFPN: inputs=[1024, 512] -> output=512. Code Python sẽ tự Conv 1024->512
  - [[-1, 9], 1, BiFPN, [512]] # 14
  - [-1, 2, A2C2f, [512, False, -1]] # 15

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 16
  # BiFPN: inputs=[512, 256] -> output=256
  - [[-1, 5], 1, BiFPN, [256]] # 17
  - [-1, 2, C3k2, [256, False]] # 18 (P3)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 19
  # BiFPN: inputs=[256, 128] -> output=128
  - [[-1, 2], 1, BiFPN, [128]] # 20
  - [-1, 2, C3k2, [128, False]] # 21 (P2)
  - [-1, 1, CoordAtt, [128]] # 22

  # === Bottom-up ===

  # P2 -> P3
  - [-1, 1, Conv, [256, 3, 2]] # 23
  # BiFPN: inputs=[256, 256, 256] -> output=256
  # (Layer 23=256, Layer 5=256, Layer 18=256) -> Khớp hoàn hảo
  - [[-1, 5, 18], 1, BiFPN, [256]] # 24
  - [-1, 4, C3k2, [256, False]] # 25
  - [-1, 1, CoordAtt, [256]] # 26

  # P3 -> P4
  - [-1, 1, Conv, [512, 3, 2]] # 27
  # BiFPN: inputs=[512, 512, 512] -> output=512
  # (Layer 27=512, Layer 9=512, Layer 15=512) -> Khớp hoàn hảo
  - [[-1, 9, 15], 1, BiFPN, [512]] # 28
  - [-1, 4, A2C2f, [512, False, -1]] # 29
  - [-1, 1, CoordAtt, [512]] # 30

  # P4 -> P5
  - [-1, 1, Conv, [1024, 3, 2]] # 31
  # BiFPN: inputs=[1024, 1024] -> output=1024
  - [[-1, 12], 1, BiFPN, [1024]] # 32
  - [-1, 2, C3k2, [1024, True]] # 33

  # Detect
  - [[26, 30, 33], 1, Detect, [nc]]