# YOLOv12-BiFPN-P2-Injection 🚀
# Features:
# 1. Single CA at Backbone End.
# 2. P2 Injection Loop (P3->P2->P3) to enrich small object features.
# 3. No P2 Detection (Detect P3-P5 only).

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ---------------------------
# Backbone (Giữ nguyên)
# ---------------------------
backbone:
  - [-1, 1, Conv, [64, 3, 2]]             # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 1 - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2 - P2
  - [-1, 1, Conv, [256, 3, 2]]            # 3 - pre P3
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4 - P3
  - [-1, 1, Conv, [512, 3, 2]]            # 5 - pre P4
  - [-1, 4, A2C2f, [512, True, 4]]        # 6 - P4
  - [-1, 1, Conv, [1024, 3, 2]]           # 7 - pre P5
  - [-1, 4, A2C2f, [1024, True, 1]]       # 8
  - [-1, 1, CoordAtt, [1024]]             # 9 <--- CA duy nhất

# ---------------------------
# Head (With P2 Injection)
# ---------------------------
head:
  # === Top-down Path (FPN) ===

  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10
  - [[-1, 6], 1, BiFPN, [512]]                   # 11
  - [-1, 2, A2C2f, [512, False, -1]]             # 12 (Head P4)

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13
  - [[-1, 4], 1, BiFPN, [256]]                   # 14
  - [-1, 2, A2C2f, [256, False, -1]]             # 15 (Head P3)

  # P3 -> P2 (MỞ RỘNG: Đi xuống P2)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16
  # BiFPN Fuse: [P3_xuống, Backbone P2(2)]. Target 128 (nhẹ hơn P3)
  - [[-1, 2], 1, BiFPN, [128]]                   # 17
  - [-1, 2, C3k2, [128, False]]                  # 18 (Head P2 - Features cực chi tiết)

  # === Bottom-up Path (BiFPN 3 Inputs) ===

  # P2 -> P3 (Bơm ngược lên)
  - [-1, 1, Conv, [256, 3, 2]]                   # 19 (Downsample P2)
  # Fuse 3 nguồn: [P2_vừa_lên(19), Backbone P3(4), P3_đang_xuống(15)]
  - [[-1, 4, 15], 1, BiFPN, [256]]               # 20
  - [-1, 2, A2C2f, [256, False, -1]]             # 21 (Output P3)

  # P3 -> P4
  - [-1, 1, Conv, [512, 3, 2]]                   # 22
  # Fuse 3 nguồn: [P3_vừa_lên(22), Backbone P4(6), P4_đang_xuống(12)]
  - [[-1, 6, 12], 1, BiFPN, [512]]               # 23
  - [-1, 2, A2C2f, [512, False, -1]]             # 24 (Output P4)

  # P4 -> P5
  - [-1, 1, Conv, [1024, 3, 2]]                  # 25
  # Fuse 2 nguồn: [P4_vừa_lên(25), Backbone P5(9)]
  - [[-1, 9], 1, BiFPN, [1024]]                  # 26
  - [-1, 2, C3k2, [1024, True]]                  # 27 (Output P5)

  # Detect (Chỉ P3, P4, P5 - Bỏ qua P2 layer 18)
  - [[21, 24, 27], 1, Detect, [nc]]