# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 + EfficientNetV4 Backbone
# =================================
# EfficientNetV4 key innovations:
# - Context-Aware SE (CASE): Dual-pooling (Avg+Max) for richer channel stats
# - Multi-Kernel Depthwise Conv (MKDWConv): 3×3 + 5×5 parallel branches
# - LayerScale: Per-channel learnable scaling for training stability
# - Cosine stochastic depth schedule (smoother than linear)

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  # Stage 0: Stem — standard Conv for initial feature extraction
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  # Stage 1: Fused-MBConv V4 (expand=1, stride=1) — basic features
  - [-1, 1, FusedMBConvV4, [64, 1, 1]]     # 1-P1/2
  # Stage 2: Fused-MBConv V4 (expand=4, stride=2) — downsample to P2
  - [-1, 2, FusedMBConvV4, [128, 2, 4]]    # 2-P2/4
  # Stage 3: Fused-MBConv V4 (expand=4, stride=2) — P3 features
  - [-1, 2, FusedMBConvV4, [256, 2, 4]]    # 3-P3/8
  # Stage 4: MBConv V4 (expand=4, stride=2) — P4 with CASE + MKDWConv
  - [-1, 3, MBConvV4, [512, 2, 4]]         # 4-P4/16
  # Stage 5: MBConv V4 (expand=4, stride=1) — deeper P4 features
  - [-1, 2, MBConvV4, [512, 1, 4]]         # 5-P4/16
  # Stage 6: MBConv V4 (expand=6, stride=2) — P5 high-level features
  - [-1, 2, MBConvV4, [1024, 2, 6]]        # 6-P5/32
  # SPPF for global context aggregation
  - [-1, 1, SPPF, [1024, 5]]               # 7-P5/32
  # C2PSA for enhanced spatial attention at P5
  - [-1, 2, C2PSA, [1024]]                 # 8-P5/32

head:
  # -------- Top-down pathway (FPN) --------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 9 (P4/16)
  - [[-1, 5], 1, Concat, [1]]                   # 10 cat backbone P4 (Layer 5)
  - [-1, 2, C3k2, [512, False]]                 # 11 (P4-medium)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12 (P3/8)
  - [[-1, 3], 1, Concat, [1]]                   # 13 cat backbone P3 (Layer 3)
  - [-1, 3, C3k2, [256, False]]                 # 14 (P3-small)

  # -------- Bottom-up pathway (PAN) --------
  - [-1, 1, Conv, [256, 3, 2]]                  # 15 (P4/16)
  - [[-1, 11], 1, Concat, [1]]                  # 16 cat head P4
  - [-1, 2, C3k2, [512, False]]                 # 17 (P4-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 18 (P5/32)
  - [[-1, 8], 1, Concat, [1]]                   # 19 cat backbone P5 (C2PSA)
  - [-1, 2, C3k2, [1024, True]]                 # 20 (P5-large)

  # Detect heads at P3, P4, P5
  - [[14, 17, 20], 1, Detect, [nc]]             # 21 Detect(P3, P4, P5)
