# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P2-P5 outputs + BiFPN in head (Max mAP, P3 CoordAtt, P5 TripletAtt)

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ---------------------------
# Backbone (giữ nguyên index)
# ---------------------------
backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]          # 3
  - [-1, 2, C3k2, [512, False, 0.25]]   # 4
  - [-1, 1, Conv, [512, 3, 2]]          # 5
  - [-1, 2, C3k2, [512, True]]          # 6
  - [-1, 1, Conv, [1024, 3, 2]]         # 7
  - [-1, 2, C3k2, [1024, True]]         # 8
  - [-1, 1, SPPF, [1024, 5]]            # 9
  - [-1, 1, C2PSA, [1024]]              # 10
  - [-1, 1, TripletAttention, [1024]]   # 11 (P5 TripletAttention)

# ---------------------------
# Head (BiFPN, làm giàu P3)
# ---------------------------
head:
  # Projections về 256 cho BiFPN
  - [4, 1, Conv, [256, 1, 1]]           # 12 <- P3
  - [6, 1, Conv, [256, 1, 1]]           # 13 <- P4
  - [11, 1, Conv, [256, 1, 1]]          # 14 <- P5 (sau TripletAttention)
  - [2, 1, Conv, [256, 1, 1]]           # 15 <- P2

  # Top-down: P5 -> P4
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]  # 16
  - [[-1, 13], 1, BiFPN, [256]]                 # 17
  - [-1, 3, C3k2, [256, False]]                 # 18  (P4')

  # Top-down: P4' -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 19
  - [[-1, 12], 1, BiFPN, [256]]                 # 20
  - [-1, 3, C3k2, [256, False]]                 # 21  (P3')
  - [-1, 1, CoordAtt, []]                       # 22  (P3' qua CoordAttention)

  # Top-down: P3'(CoordAtt) -> P2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 23
  - [[-1, 15], 1, BiFPN, [256]]                 # 24
  - [-1, 2, C3k2, [128, False]]                 # 25  (P2' final, 128 ch)

  # Bottom-up: P2' -> P3
  - [-1, 1, Conv, [256, 3, 2]]                  # 26  (P2' -> P3 scale)
  - [[-1, 12, 22], 1, BiFPN, [256]]             # 27  (dùng P3_proj + P3'(CoordAtt))
  - [-1, 4, C3k2, [256, False]]                 # 28  (P3_refined, tăng repeats 4)

  # Bottom-up: P3_refined -> P4
  - [-1, 1, Conv, [256, 3, 2]]                  # 29
  - [[-1, 13, 18], 1, BiFPN, [256]]             # 30
  - [-1, 4, C3k2, [512, False]]                 # 31  (P4_refined)

  # Bottom-up: P4_refined -> P5
  - [-1, 1, Conv, [256, 3, 2]]                  # 32
  - [[-1, 14], 1, BiFPN, [256]]                 # 33  (nhất quán dùng -1)
  - [-1, 3, C3k2, [1024, True]]                 # 34  (P5_refined)

  # Detect trên P2, P3, P4, P5
  - [[25, 28, 31, 34], 1, Detect, [nc]]
