# Ultralytics YOLO 🚀, AGPL-3.0
# YOLO12 POWER: Clean Structure + Heavy Backbone + BiFPN + ECA (BCCD Safe)

nc: 80   # BCCD = 3 nếu cần

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# =========================
# Backbone
# =========================
backbone:
  - [-1, 1, Conv, [64, 3, 2]]             # 0
  - [-1, 1, Conv, [128, 3, 2]]            # 1
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5
  - [-1, 2, C3k2, [512, True]]            # 6
  - [-1, 1, Conv, [1024, 3, 2]]           # 7
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 1, C2PSA, [1024]]                # 10

  # ✅ TripletAttention → ECA (ĐÚNG CÚ PHÁP)
  - [-1, 1, ECA, [1024]]                  # 11

# =========================
# Head (BiFPN)
# =========================
head:
  # === Top-down ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 6], 1, BiFPN, [256]]                   # 13
  - [-1, 2, C3k2, [256, False]]                  # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15
  - [[-1, 4], 1, BiFPN, [256]]                   # 16
  - [-1, 2, C3k2, [256, False]]                  # 17
  - [-1, 1, ECA, [256]]                             # 18  (thay TripletAttention)

  # === P2 Loop ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 19
  - [[-1, 2], 1, BiFPN, [256]]                   # 20
  - [-1, 3, C3k2, [128, False]]                  # 21
  - [-1, 1, ECA, [128]]                             # 22

  # === Bottom-up ===
  # P3 Output
  - [-1, 1, Conv, [256, 3, 2]]                   # 23
  - [[-1, 4, 18], 1, BiFPN, [256]]               # 24
  - [-1, 4, C3k2, [256, False]]                  # 25
  - [-1, 1, ECA, [256]]                             # 26

  # P4 Output
  - [-1, 1, Conv, [256, 3, 2]]                   # 27
  - [[-1, 6, 14], 1, BiFPN, [256]]               # 28
  - [-1, 4, C3k2, [512, False]]                  # 29
  - [-1, 1, ECA, [512]]                             # 30

  # P5 Output
  - [-1, 1, Conv, [256, 3, 2]]                   # 31
  - [[-1, 11], 1, BiFPN, [256]]                  # 32
  - [-1, 2, C3k2, [1024, True]]                  # 33

  # Detect
  - [[26, 30, 33], 1, Detect, [nc]]
