# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P2-P5 + BiFPN (DeepPCB-MAX, PR-Boosted)

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ---------------------------
# Backbone
# ---------------------------
backbone:
  - [-1, 1, Conv, [64, 3, 2]]            # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]           # 1 - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]    # 2 - P2 feature
  - [-1, 1, Conv, [256, 3, 2]]           # 3 - pre P3
  - [-1, 2, C3k2, [512, False, 0.25]]    # 4 - P3 output
  - [-1, 1, Conv, [512, 3, 2]]           # 5 - pre P4
  - [-1, 2, C3k2, [512, True]]           # 6 - P4 output
  - [-1, 1, Conv, [1024, 3, 2]]          # 7 - pre P5
  - [-1, 2, C3k2, [1024, True]]          # 8 - deeper P5
  - [-1, 1, SPPF, [1024, 5]]             # 9
  - [-1, 1, C2PSA, [1024]]               # 10 - P5 channel-context
  - [-1, 1, CoordAtt, []]                # 11 - P5 light att

# ---------------------------
# Head (BiFPN, ưu tiên P2/P3/P4)
# ---------------------------
head:
  # Projections -> 256
  - [4,  1, Conv, [256, 1, 1]]           # 12 <- P3
  - [6,  1, Conv, [256, 1, 1]]           # 13 <- P4
  - [11, 1, Conv, [256, 1, 1]]           # 14 <- P5 (sau CoordAtt)
  - [2,  1, Conv, [256, 1, 1]]           # 15 <- P2

  # Top-down: P5 -> P4
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]  # 16
  - [[-1, 13], 1, BiFPN, [256]]                 # 17
  - [-1, 3, C3k2, [256, False]]                 # 18  # P4'

  # Top-down: P4' -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 19
  - [[-1, 12], 1, BiFPN, [256]]                 # 20
  - [-1, 3, C3k2, [256, False]]                 # 21  # P3'
  - [-1, 1, TripletAttention, [256]]            # 22  # P3' att (tiny/occlusion)

  # Top-down: P3'(att) -> P2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 23
  - [[-1, 15], 1, BiFPN, [256]]                 # 24
  - [-1, 4, C3k2, [128, False]]                 # 25  # P2' (repeats 4)
  - [-1, 1, TripletAttention, [128]]            # 26  # P2' att (mạnh tay)
  - [-1, 1, CoordAtt, []]                       # 27  # NEW: ổn định logit P2' (↓FP, P↑)

  # Bottom-up: P2' -> P3
  - [-1, 1, Conv, [256, 3, 2]]                  # 28
  - [[-1, 12, 22], 1, BiFPN, [256]]             # 29  # fuse (P2↓, P3_proj, P3'(att))
  - [-1, 6, C3k2, [256, False]]                 # 30  # ↑ repeats 5 -> 6 (P3_refined, R↑)
  - [-1, 1, CoordAtt, []]                       # 31  # P3_refined att (nhẹ, ổn định)

  # Bottom-up: P3_refined -> P4
  - [-1, 1, Conv, [256, 3, 2]]                  # 32
  - [[-1, 13, 18], 1, BiFPN, [256]]             # 33
  - [-1, 5, C3k2, [512, False]]                 # 34  # P4_refined (giữ 5)
  - [-1, 1, CoordAtt, []]                       # 35  # P4_refined att (giảm FP)

  # Bottom-up: P4_refined -> P5
  - [-1, 1, Conv, [256, 3, 2]]                  # 36
  - [[-1, 14], 1, BiFPN, [256]]                 # 37
  - [-1, 3, C3k2, [1024, True]]                 # 38  # P5_refined

  # Detect (dùng feature sau att nơi cần)
  - [[27, 31, 35, 38], 1, Detect, [nc]]         # P2, P3, P4, P5
