# Ultralytics YOLO 🚀, AGPL-3.0
# YOLO11 object detection (Traffic-4cls): P3 TripletAtt, P4 CoordAtt, P5 MHSA, BiFPN, no P2 head

# Parameters
nc: 4
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ---------------------------
# Backbone
# ---------------------------
backbone:
  - [-1, 1, Conv, [64, 3, 2]]             # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 1 - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2 - P2 feat
  - [-1, 1, Conv, [256, 3, 2]]            # 3 - pre P3
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4 - P3
  - [-1, 1, Conv, [512, 3, 2]]            # 5 - pre P4
  - [-1, 2, C3k2, [512, True]]            # 6 - P4
  - [-1, 1, Conv, [1024, 3, 2]]           # 7 - pre P5
  - [-1, 2, C3k2, [1024, True]]           # 8 - deep P5
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 1, C2PSA, [1024]]                # 10 - channel-context
  - [-1, 1, MHSA, [4]]                    # 11 - P5 global (heads=4)

# ---------------------------
# Head (BiFPN, P3–P5)
# ---------------------------
head:
  # Projections to 256
  - [4,  1, Conv, [256, 1, 1]]            # 12 <- P3
  - [6,  1, Conv, [256, 1, 1]]            # 13 <- P4
  - [11, 1, Conv, [256, 1, 1]]            # 14 <- P5 (after MHSA)

  # Top-down: P5 -> P4
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]   # 15
  - [[-1, 13], 1, BiFPN, [256]]                  # 16
  - [-1, 3, C3k2, [256, False]]                  # 17  # P4'

  # Top-down: P4' -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 18
  - [[-1, 12], 1, BiFPN, [256]]                  # 19
  - [-1, 3, C3k2, [256, False]]                  # 20  # P3'
  - [-1, 1, TripletAttention, [256]]             # 21  # P3' att (crowd/occlusion)

  # Bottom-up: P3'(att) -> P4
  - [-1, 1, Conv, [256, 3, 2]]                   # 22  # to P4 scale
  - [[-1, 13, 17], 1, BiFPN, [256]]              # 23  # fuse (P3↓, P4_proj, P4')
  - [-1, 3, C3k2, [512, False]]                  # 24  # P4_refined
  - [-1, 1, CoordAtt, []]                        # 25  # P4_out (reduce FP mid-scale)

  # Bottom-up: P4_out -> P5
  - [25, 1, Conv, [256, 3, 2]]                   # 26  # to P5 scale (256 for fusion)
  - [[-1, 14], 1, BiFPN, [256]]                  # 27  # fuse (P4↓, P5_proj)
  - [-1, 3, C3k2, [1024, True]]                  # 28  # P5_out

  # Detect on P3, P4, P5
  - [[21, 25, 28], 1, Detect, [nc]]
