nc: 80
scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, FusedMBConv, [64, 1, 1]]  # 1-P1/2
  - [-1, 2, FusedMBConv, [128, 2, 4]] # 2-P2/4
  - [-1, 2, FusedMBConv, [256, 2, 4]] # 3-P3/8
  - [-1, 3, MBConv, [512, 2, 4]]      # 4-P4/16
  - [-1, 2, MBConv, [512, 1, 4]]      # 5-P4/16
  - [-1, 2, MBConv, [1024, 2, 5]]     # 6-P5/32
  # >>> THÊM ĐÚNG 1 TẦNG NÀY (Lọc sạch thượng nguồn) <<<
  - [ -1, 1, CBAM, [1024]]           # 7-P5/32
  - [-1, 1, SPPF, [1024, 5]]          # 8-P5/32


head:
  # -------- Top-down pathway --------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 9 (Giữ nguyên nearest)
  - [[-1, 5], 1, Concat, [1]]                   # 10 cat backbone P4
  - [-1, 2, C3k2_CBAM, [512, False]]            # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12 (Giữ nguyên nearest)
  - [[-1, 3], 1, Concat, [1]]                   # 13 cat backbone P3
  - [-1, 3, C3k2_CBAM, [256, False]]            # 14 (P3-small)

  # -------- Bottom-up pathway --------
  - [-1, 1, Conv, [256, 3, 2]]                  # 15
  - [[-1, 11], 1, Concat, [1]]                  # 16
  - [-1, 2, C3k2_CBAM, [512, False]]            # 17 (P4-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 18
  - [[-1, 8], 1, Concat, [1]]                   # 19 cat nối với tầng CBAM số 8
  - [-1, 2, C3k2, [1024, True]]                 # 20 (P5-large - Giữ nguyên không đụng tới)

  # Detect lấy đầu ra từ 14, 17, 20
  - [[14, 17, 20], 1, Detect, [nc]]             # 21