# YOLO11-P2-BiFPN model
# Anchors will be automatically generated
# Channels order: [P2, P3, P4, P5] -> stride = [4, 8, 16, 32]

# Parameters
nc: 80  # number of classes
scales:  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]  # ~2.6M params
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 3, 2]]             # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 1 - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3 - P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5 - P4/16
  - [-1, 2, C3k2, [512, True]]            # 6
  - [-1, 1, Conv, [1024, 3, 2]]           # 7 - P5/32
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10 - P5 output

head:
  # Feature Adjustments
  - [1, 1, Conv, [256]]                   # 11 - P2 feature adjust
  - [3, 1, Conv, [256]]                   # 12 - P3
  - [5, 1, Conv, [512]]                   # 13 - P4
  - [9, 1, Conv, [1024]]                  # 14 - P5

  # P2 + P3 BiFPN
  - [12, 1, nn.Upsample, [None, 2, "nearest"]]   # 15 - P3 -> P2 scale
  - [[15, 11], 1, BiFPN, []]                     # 16 - BiFPN(P3↑, P2)
  - [-1, 1, C3k2, [128]]                         # 17 - P2'

  # P2' -> P3 + BiFPN
  - [17, 1, Conv, [256, 3, 2]]                   # 18 - P2' -> P3
  - [[18, 12], 1, BiFPN, []]                     # 19 - BiFPN(P2↓, P3)
  - [-1, 1, C3k2, [256]]                         # 20 - P3'

  # P3' -> P4 + BiFPN
  - [20, 1, Conv, [512, 3, 2]]                   # 21 - P3' -> P4
  - [[21, 13], 1, BiFPN, []]                     # 22 - BiFPN(P3↓, P4)
  - [-1, 1, C3k2, [512]]                         # 23 - P4'

  # P4' -> P5 + BiFPN
  - [23, 1, Conv, [1024, 3, 2]]                  # 24 - P4' -> P5
  - [[24, 14], 1, BiFPN, []]                     # 25 - BiFPN(P4↓, P5)
  - [-1, 1, C3k2, [1024]]                        # 26 - P5'

  # Detect: P2', P3', P4', P5'
  - [[17, 20, 23, 26], 1, Detect, [nc]]          # 27 - Final detection head
