nc: 80
scales:
  # Sử dụng scale n của YOLO11: depth_multiple=0.5, width_multiple=0.25
  n: [0.50, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  # Stage 0: Stem
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  # Stage 1: Fused-MBConv (L=2)
  - [-1, 1, FusedMBConv, [64, 1, 1]]   # 1-P1/2
  # Stage 2: Fused-MBConv (L=4)
  - [-1, 2, FusedMBConv, [128, 2, 4]]  # 2-P2/4
  # Stage 3: Fused-MBConv (L=4) -> Kết nối P3
  - [-1, 2, FusedMBConv, [256, 2, 4]]  # 3-P3/8
  # Stage 4: MBConv (L=6) -> Kết nối P4
  - [-1, 2, MBConv, [512, 2, 4]]       # 4-P4/16
  # Stage 5: MBConv (L=9, stride 1)
  - [-1, 2, MBConv, [512, 1, 4]]       # 5-P4/16
  # Stage 6: MBConv (L=15) -> Kết nối P5
  - [-1, 2, MBConv, [1024, 2, 5]]     # 6-P5/32
  # Thành phần bổ trợ cho YOLO11
  - [-1, 1, SPPF, [1024, 5]]           # 7
  - [-1, 2, C2PSA, [1024]]             # 8-P5/32

head:
  # -------- Top-down pathway --------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 9
  - [[-1, 5], 1, BiFPN_Concat, [1]]             # 10
  - [-1, 2, C3k2, [512, False]]                 # 11 (Đầu ra P4 mới)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12
  - [[-1, 3], 1, BiFPN_Concat, [1]]             # 13
  - [-1, 2, C3k2, [256, False]]                 # 14 (Đầu ra P3 mới)

  # -------- Bottom-up pathway --------
  - [-1, 1, Conv, [256, 3, 2]]                  # 15
  - [[-1, 11], 1, BiFPN_Concat, [1]]            # 16 (Nối với Layer 11 là P4 thay vì 12 cũ)
  - [-1, 2, C3k2, [512, False]]                 # 17

  - [-1, 1, Conv, [512, 3, 2]]                  # 18
  - [[-1, 8], 1, BiFPN_Concat, [1]]             # 19 (Giữ nguyên nối với backbone layer 8)
  - [-1, 2, C3k2, [1024, True]]                 # 20 (Đầu ra P5 mới)

  # Detect lấy đầu ra từ các nhánh P3, P4, P5
  - [[14, 17, 20], 1, Detect, [nc]]             # 21 (Cập nhật index: 16->14, 19->17, 22->20)