# Ultralytics YOLO 🚀, AGPL-3.0
# YOLO11 backbone + P2 fuse (no P2 detect) + BiFPN (CoordAtt removed)

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ---------------------------
# Backbone (YOLO11)
# ---------------------------
backbone:
  - [-1, 1, Conv, [64, 3, 2]]             # 0
  - [-1, 1, Conv, [128, 3, 2]]            # 1
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2  P2
  - [-1, 1, Conv, [256, 3, 2]]            # 3  pre P3
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4  P3
  - [-1, 1, Conv, [512, 3, 2]]            # 5  pre P4
  - [-1, 2, C3k2, [512, True]]            # 6  P4
  - [-1, 1, Conv, [1024, 3, 2]]           # 7  pre P5
  - [-1, 2, C3k2, [1024, True]]           # 8  P5 deep
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 1, C2PSA, [1024]]                # 10
  - [-1, 1, MHSA, [14, 4, 4]]             # 11  (P5 att)

# ---------------------------
# Head (BiFPN, P2 fuse; Detect P3-P5)
# ---------------------------
head:
  # Projections -> 256
  - [4,  1, Conv, [256, 1, 1]]            # 12  P3 proj
  - [6,  1, Conv, [256, 1, 1]]            # 13  P4 proj
  - [11, 1, Conv, [256, 1, 1]]            # 14  P5 proj (sau C2PSA+MHSA)
  - [2,  1, Conv, [256, 1, 1]]            # 15  P2 proj

  # Top-down: P5 -> P4
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]   # 16
  - [[-1, 13], 1, BiFPN, [256]]                  # 17
  - [-1, 2, C3k2, [256, False]]                  # 18  P4'

  # Top-down: P4' -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 19
  - [[-1, 12], 1, BiFPN, [256]]                  # 20
  - [-1, 3, C3k2, [256, False]]                  # 21  P3'

  # Top-down: P3' -> P2 (FUSE ONLY, NO DETECT)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 22
  - [[-1, 15], 1, BiFPN, [256]]                  # 23
  - [-1, 3, C3k2, [128, False]]                  # 24  P2'

  # Bottom-up: P2' -> P3
  - [24, 1, Conv, [256, 3, 2]]                   # 25
  - [[-1, 12, 21], 1, BiFPN, [256]]              # 26  (P2↓, P3_proj, P3')
  - [-1, 5, C3k2, [256, False]]                  # 27  P3_refined

  # Bottom-up: P3_refined -> P4
  - [-1, 1, Conv, [256, 3, 2]]                   # 28
  - [[-1, 13, 18], 1, BiFPN, [256]]              # 29  (P3_refined↓, P4_proj, P4')
  - [-1, 4, C3k2, [512, False]]                  # 30  P4_refined

  # Bottom-up: P4_refined -> P5
  - [-1, 1, Conv, [256, 3, 2]]                   # 31
  - [[-1, 14], 1, BiFPN, [256]]                  # 32  (P4_refined↓, P5_proj)
  - [-1, 2, C3k2, [1024, True]]                  # 33  P5_refined

  # Detect: P3, P4, P5
  - [[27, 30, 33], 1, Detect, [nc]]              # 34
