nc: 80
scales:
  # Sử dụng scale n của YOLO11: depth_multiple=0.5, width_multiple=0.25
  n: [0.50, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  # Stage 0: Stem
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  # Stage 1: Fused-MBConv (L=2)
  - [-1, 1, FusedMBConv, [64, 1, 1]]  # 1-P1/2
  # Stage 2: Fused-MBConv (L=4)
  - [-1, 2, FusedMBConv, [128, 2, 4]] # 2-P2/4
  # Stage 3: Fused-MBConv (L=4) -> Kết nối P3
  - [-1, 2, FusedMBConv, [256, 2, 4]] # 3-P3/8
  # Stage 4: MBConv (L=6) -> Kết nối P4
  - [-1, 3, MBConv, [512, 2, 4]]      # 4-P4/16
  # Stage 5: MBConv (L=9, stride 1)
  - [-1, 2, MBConv, [512, 1, 4]]      # 5-P4/16
  # Stage 6: MBConv (L=15) -> Kết nối P5
  - [-1, 2, MBConv, [1024, 2, 5]]     # 6-P5/32 (Đầu ra cuối cùng của Backbone)

head:
  # -------- Top-down pathway --------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 7 (P4/16)
  - [[-1, 5], 1, Concat, [1]]                   # 8 cat backbone P4 (Layer 5)
  - [-1, 3, C3k2_CBAM, [512, False]]            # 9 (P4-medium)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10 (P3/8)
  - [[-1, 3], 1, Concat, [1]]                   # 11 cat backbone P3 (Layer 3)
  - [-1, 3, C3k2_CBAM, [256, False]]            # 12 (P3-small)

  # -------- Bottom-up pathway --------
  - [-1, 1, Conv, [256, 3, 2]]                  # 13 (P4/16)
  - [[-1, 9], 1, Concat, [1]]                   # 14 cat head P4 (Nối với Layer 9)
  - [-1, 3, C3k2_CBAM, [512, False]]             # 15 (P4-medium - Bật True)

  - [-1, 1, Conv, [512, 3, 2]]                  # 16 (P5/32)
  - [[-1, 6], 1, Concat, [1]]                   # 17 cat backbone P5 (Nối trực tiếp từ Layer 6 do đã bỏ SPPF)
  - [-1, 2, C3k2, [1024, True]]                 # 18 (P5-large)

  # Detect lấy đầu ra từ các lớp P3, P4, P5
  - [[12, 15, 18], 1, Detect, [nc]]             # 19 Detect(P3, P4, P5)