# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11-BiFPN model with P3-P5 outputs (nhẹ, chuẩn YOLO11, cải tiến từ YOLOv8-BiFPN)

# Parameters
nc: 80  # number of classes
scales: # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]  # ~2.6M params
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11-BiFPN backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]            # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]           # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]    # 2
  - [-1, 1, Conv, [256, 3, 2]]           # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]    # 4
  - [-1, 1, Conv, [512, 3, 2]]           # 5-P4/16
  - [-1, 2, C3k2, [512, True]]           # 6
  - [-1, 1, Conv, [1024, 3, 2]]          # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]          # 8
  - [-1, 1, SPPF, [1024, 5]]             # 9
  - [-1, 2, C2PSA, [1024]]               # 10 (P5 output)

# YOLO11-BiFPN head (dựa theo YOLOv8-BiFPN)
head:
  - [4, 1, Conv, [512]]                  # 11: P3 từ backbone
  - [6, 1, Conv, [512]]                  # 12: P4 từ backbone
  - [10, 1, Conv, [512]]                 # 13: P5 từ backbone

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 14: P5 -> P4
  - [[-1, 12], 1, BiFPN, []]             # 15: BiFPN(P5↑, P4)
  - [-1, 2, C3k2, [512, False]]          # 16: P4'

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 17: P4' -> P3
  - [[-1, 11], 1, BiFPN, []]             # 18: BiFPN(P4'↑, P3)
  - [-1, 2, C3k2, [256, False]]          # 19: P3'

  - [19, 1, Conv, [512, 3, 2]]           # 20: P3' -> P4 scale
  - [[-1, 16], 1, BiFPN, []]             # 21: BiFPN(P3↓, P4')
  - [-1, 2, C3k2, [512, False]]          # 22: P4''

  - [22, 1, Conv, [512, 3, 2]]           # 23: P4'' -> P5 scale
  - [[-1, 13], 1, BiFPN, []]             # 24: BiFPN(P4↓, P5)
  - [-1, 2, C3k2, [1024, True]]          # 25: P5'

  - [[19, 22, 25], 1, Detect, [nc]]      # 26: Detect(P3’, P4”, P5’)
