# Ultralytics YOLO 🚀, AGPL-3.0
# YOLO12 Optimized: Removed redundant projections, Balanced repeats.

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ---------------------------
# Backbone (YOLO11/12 logic + CA)
# ---------------------------

backbone:
  - [-1, 1, Conv, [64, 3, 2]]             # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 1 - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2 - P2
  - [-1, 1, Conv, [256, 3, 2]]            # 3 - pre P3
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4 - P3
  - [-1, 1, Conv, [512, 3, 2]]            # 5 - pre P4
  - [-1, 2, C3k2, [512, True]]            # 6 - P4
  - [-1, 1, Conv, [1024, 3, 2]]           # 7 - pre P5
  - [-1, 2, C3k2, [1024, True]]           # 8 - P5 deep
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 1, C2PSA, [1024]]                # 10
  - [-1, 1, CoordAtt, []]                 # 11 <--- Backbone P5 (Output P5)

# ---------------------------
# Head (BiFPN Optimized)
# ---------------------------
head:
  # === Top-down (FPN) ===

  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  # BiFPN nối trực tiếp với Backbone P4 (Layer 6)
  # Code Python sẽ tự Scale: 256*0.25=64. Input Layer 6 cũng 64 -> Khớp!
  - [[-1, 6], 1, BiFPN, [256]]                   # 13
  - [-1, 2, C3k2, [256, False]]                  # 14 (P4')

  # P4' -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15
  # BiFPN nối trực tiếp với Backbone P3 (Layer 4)
  - [[-1, 4], 1, BiFPN, [256]]                   # 16
  - [-1, 2, C3k2, [256, False]]                  # 17 (P3')
  - [-1, 1, CoordAtt, []]                        # 18 (P3' Att)

  # P3' -> P2 (Vòng lặp Fuse P2)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 19
  # BiFPN nối trực tiếp với Backbone P2 (Layer 2)
  - [[-1, 2], 1, BiFPN, [256]]                   # 20
  - [-1, 2, C3k2, [128, False]]                  # 21 (P2')
  - [-1, 1, CoordAtt, []]                        # 22 (P2' Att)

  # === Bottom-up (BiFPN 3 Inputs) ===

  # P2' -> P3
  - [-1, 1, Conv, [256, 3, 2]]                   # 23 (Downsample)
  # Fuse: [P2_lên, P3_gốc(4), P3_xuống(18)]
  - [[-1, 4, 18], 1, BiFPN, [256]]               # 24
  - [-1, 3, C3k2, [256, False]]                  # 25 (P3_refined)
  - [-1, 1, CoordAtt, []]                        # 26 -> Output P3

  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]                   # 27
  # Fuse: [P3_lên, P4_gốc(6), P4_xuống(14)]
  - [[-1, 6, 14], 1, BiFPN, [256]]               # 28
  - [-1, 3, C3k2, [512, False]]                  # 29 (P4_refined)
  - [-1, 1, CoordAtt, []]                        # 30 -> Output P4

  # P4 -> P5
  - [-1, 1, Conv, [256, 3, 2]]                   # 31
  # Fuse: [P4_lên, Backbone P5(11)]
  - [[-1, 11], 1, BiFPN, [256]]                  # 32
  - [-1, 2, C3k2, [1024, True]]                  # 33 (P5_refined)

  # Detect Standard (P3, P4, P5)
  - [[26, 30, 33], 1, Detect, [nc]]