# Ultralytics YOLO 🚀, AGPL-3.0
# YOLO11 backbone + P2 fuse (no P2 detect) + BiFPN + ECA@P5 + ECA(P2/P3/P4)

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ---------------------------
# Backbone (YOLO11 + ECA@P5)
# ---------------------------
backbone:
  - [-1, 1, Conv, [64, 3, 2]]             # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 1 - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2 - P2
  - [-1, 1, Conv, [256, 3, 2]]            # 3 - pre P3
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4 - P3
  - [-1, 1, Conv, [512, 3, 2]]            # 5 - pre P4
  - [-1, 2, C3k2, [512, True]]            # 6 - P4
  - [-1, 1, Conv, [1024, 3, 2]]           # 7 - pre P5
  - [-1, 2, C3k2, [1024, True]]           # 8 - P5 deep
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 1, C2PSA, [1024]]                # 10
  - [-1, 1, ECA, [1024]]                  # 11  (ECA @ P5)

# ---------------------------
# Head (BiFPN, P2 fuse; Detect P3-P5)
# ---------------------------
head:
  # Projections -> 256
  - [4,  1, Conv, [256, 1, 1]]            # 12 <- P3
  - [6,  1, Conv, [256, 1, 1]]            # 13 <- P4
  - [11, 1, Conv, [256, 1, 1]]            # 14 <- P5 (sau C2PSA+ECA)
  - [2,  1, Conv, [256, 1, 1]]            # 15 <- P2

  # Top-down: P5 -> P4
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]   # 16
  - [[-1, 13], 1, BiFPN, [256]]                  # 17
  - [-1, 2, C3k2, [256, False]]                  # 18  # P4'

  # Top-down: P4' -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 19
  - [[-1, 12], 1, BiFPN, [256]]                  # 20
  - [-1, 3, C3k2, [256, False]]                  # 21  # P3'
  - [-1, 1, ECA, [256]]                          # 22  # P3 att (ECA)

  # Top-down: P3'(att) -> P2 (FUSE CHỈ, KHÔNG DETECT)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 23
  - [[-1, 15], 1, BiFPN, [256]]                  # 24
  - [-1, 3, C3k2, [128, False]]                  # 25  # P2' (repeats=3, nhẹ)
  - [-1, 1, ECA, [128]]                          # 26  # P2 att (ECA)

  # Bottom-up: P2' -> P3
  - [-1, 1, Conv, [256, 3, 2]]                   # 27: P2' -> P3 scale
  - [[-1, 12, 22], 1, BiFPN, [256]]              # 28: fuse (P2↓, P3_proj, P3 att)
  - [-1, 5, C3k2, [256, False]]                  # 29: P3_refined (repeats=5)
  - [-1, 1, ECA, [256]]                          # 30: P3_refined att (ECA)

  # Bottom-up: P3_refined -> P4
  - [-1, 1, Conv, [256, 3, 2]]                   # 31
  - [[-1, 13, 18], 1, BiFPN, [256]]              # 32
  - [-1, 4, C3k2, [512, False]]                  # 33: P4_refined (repeats=4)
  - [-1, 1, ECA, [512]]                          # 34: P4_refined att (ECA)

  # Bottom-up: P4_refined -> P5
  - [-1, 1, Conv, [256, 3, 2]]                   # 35
  - [[-1, 14], 1, BiFPN, [256]]                  # 36
  - [-1, 2, C3k2, [1024, True]]                  # 37: P5_refined (repeats=2)

  # Detect: CHỈ P3, P4, P5
  - [[30, 34, 37], 1, Detect, [nc]]
