# Ultralytics YOLO 🚀, AGPL-3.0
# Backbone: YOLO11 gốc với C2PSA×2. Head: BiFPN 256c, P2 fuse-only (no P2 detect), Detect P3–P5.

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]            # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]           # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]    # 2
  - [-1, 1, Conv, [256, 3, 2]]           # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]    # 4-P3
  - [-1, 1, Conv, [512, 3, 2]]           # 5-P4/16
  - [-1, 2, C3k2, [512, True]]           # 6-P4
  - [-1, 1, Conv, [1024, 3, 2]]          # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]          # 8-P5
  - [-1, 1, SPPF, [1024, 5]]             # 9
  - [-1, 2, C2PSA, [1024]]               # 10-P5_out

head:
  # Projections 256c
  - [4,  1, Conv, [256]]                 # 11: P3_proj
  - [6,  1, Conv, [256]]                 # 12: P4_proj
  - [10, 1, Conv, [256]]                 # 13: P5_proj

  # Top-down
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 14
  - [[-1, 12], 1, BiFPN, [256]]                  # 15
  - [-1, 3, C3k2, [256, False]]                  # 16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 17
  - [[-1, 11], 1, BiFPN, [256]]                  # 18
  - [-1, 3, C3k2, [256, False]]                  # 19  # P3_td

  # Fuse P2 -> P3 (no P2 detect)
  - [1, 1, Conv, [256, 3, 2]]                    # 20: P2 -> P3 scale
  - [[-1, 11, 19], 1, BiFPN, [256]]              # 21
  - [-1, 3, C3k2, [256, False]]                  # 22  # P3_out

  # Bottom-up
  - [-1, 1, Conv, [256, 3, 2]]                   # 23
  - [[-1, 12, 16], 1, BiFPN, [256]]              # 24
  - [-1, 3, C3k2, [512, False]]                  # 25  # P4_out

  - [-1, 1, Conv, [256, 3, 2]]                   # 26
  - [[-1, 13], 1, BiFPN, [256]]                  # 27
  - [-1, 3, C3k2, [1024, True]]                  # 28  # P5_out

  - [[22, 25, 28], 1, Detect, [nc]]              # Detect(P3, P4, P5)
