# Ultralytics YOLO 🚀, AGPL-3.0
# YOLO11 POWER: Heavy Backbone + BiFPN
# Attention: TripletAttention (Backbone) + ECA(P3) + CoordAtt(P4)

nc: 80   # BCCD = 3 nếu cần

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# =========================
# Backbone (TripletAttention)
# =========================
backbone:
  - [-1, 1, Conv, [64, 3, 2]]             # 0
  - [-1, 1, Conv, [128, 3, 2]]            # 1
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5
  - [-1, 2, C3k2, [512, True]]            # 6
  - [-1, 1, Conv, [1024, 3, 2]]           # 7
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 1, C2PSA, [1024]]                # 10

  # 🔥 TripletAttention (NO ARGS)
  - [-1, 1, TripletAttention, [1024]]         # 11

# =========================
# Head (BiFPN)
# =========================
head:
  # === Top-down ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 6], 1, BiFPN, [256]]                   # 13
  - [-1, 2, C3k2, [256, False]]                  # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15
  - [[-1, 4], 1, BiFPN, [256]]                   # 16
  - [-1, 2, C3k2, [256, False]]                  # 17

  # ===== P3 (ECA – channel, tăng Precision) =====
  - [-1, 1, ECA, [256]]                          # 18

  # === P2 Loop (NO attention) ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 19
  - [[-1, 2], 1, BiFPN, [256]]                   # 20
  - [-1, 3, C3k2, [128, False]]                  # 21
  # ❌ KHÔNG attention tại P2

  # === Bottom-up ===
  # P3 refined
  - [-1, 1, Conv, [256, 3, 2]]                   # 22
  - [[-1, 4, 18], 1, BiFPN, [256]]               # 23
  - [-1, 4, C3k2, [256, False]]                  # 24
  - [-1, 1, ECA, [256]]                          # 25  ✅ P3 (ECA)

  # P4 (CoordAtt – spatial, shape-based)
  - [-1, 1, Conv, [256, 3, 2]]                   # 26
  - [[-1, 6, 14], 1, BiFPN, [256]]               # 27
  - [-1, 4, C3k2, [512, False]]                  # 28
  - [-1, 1, CoordAtt, []]                        # 29  ✅ P4

  # P5
  - [-1, 1, Conv, [256, 3, 2]]                   # 30
  - [[-1, 11], 1, BiFPN, [256]]                  # 31
  - [-1, 2, C3k2, [1024, True]]                  # 32

  # Detect
  - [[25, 29, 32], 1, Detect, [nc]]
