# Ultralytics YOLO 🚀, AGPL-3.0
# YOLO12 OPTIMIZED: High Accuracy P2 + High Speed
# Strategy: "High Res - Low Channels" for P2

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]             # 0
  - [-1, 1, Conv, [128, 3, 2]]            # 1
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2 (P2)
  - [-1, 1, Conv, [256, 3, 2]]            # 3
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4 (P3)
  - [-1, 1, Conv, [512, 3, 2]]            # 5
  - [-1, 2, C3k2, [512, True]]            # 6 (P4)
  - [-1, 1, Conv, [1024, 3, 2]]           # 7
  - [-1, 2, C3k2, [1024, True]]           # 8 (P5)
  - [-1, 1, SPPF, [1024, 5]]              # 9

  # 🔥 TripletAttention (Backbone Output)
  - [-1, 1, TripletAttention, [1024]]     # 10

head:
  # === Top-down (FPN) ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11
  - [[-1, 6], 1, BiFPN, [256]]                   # 12 (P4)
  - [-1, 2, C3k2, [256, False]]                  # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14
  - [[-1, 4], 1, BiFPN, [256]]                   # 15 (P3)
  - [-1, 2, C3k2, [256, False]]                  # 16
  - [-1, 1, CoordAtt, []]                        # 17 (Giữ Attention P3)

  # === P2 Loop (OPTIMIZED) ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 18

  - [[-1, 2], 1, BiFPN, [64]]                    # 19

  # ⚡ CẢI TIẾN 2: C3k2 xử lý nhẹ nhàng
  - [-1, 2, C3k2, [64, False]]                   # 20

  # === Bottom-up (PANet) ===
  # P3
  - [-1, 1, Conv, [256, 3, 2]]                   # 21
  - [[-1, 4, 17], 1, BiFPN, [256]]               # 22
  - [-1, 4, C3k2, [256, False]]                  # 23
  - [-1, 1, CoordAtt, []]                        # 24 -> Detect P3

  # P4
  - [-1, 1, Conv, [256, 3, 2]]                   # 25
  - [[-1, 6, 13], 1, BiFPN, [256]]               # 26
  - [-1, 4, C3k2, [512, False]]                  # 27
  - [-1, 1, CoordAtt, []]                        # 28 -> Detect P4

  # P5
  - [-1, 1, Conv, [256, 3, 2]]                   # 29
  - [[-1, 10], 1, BiFPN, [512]]                  # 30
  - [-1, 2, C3k2, [1024, True]]                  # 31

  # Detect
  - [[20, 24, 28, 31], 1, Detect, [nc]]          # Detect(P2, P3, P4, P5)