nc: 80 # Sửa thành 4 nếu bạn dùng dataset cũ
scales:
  s: [0.50, 0.50, 1024]

backbone:
  - [-1, 1, Conv, [24, 3, 2]]         # 0 (320x320)
  - [-1, 2, FusedMBConv, [24, 1, 1]]   # 1 (320x320)
  - [-1, 4, FusedMBConv, [48, 2, 4]]   # 2 (160x160)
  - [-1, 4, FusedMBConv, [64, 2, 4]]   # 3 (80x80) - P3
  - [-1, 6, MBConv, [128, 2, 4]]       # 4 (40x40) - P4
  - [-1, 9, MBConv, [160, 1, 6]]       # 5 (40x40) - Stride 1 giữ nguyên
  - [-1, 15, MBConv, [256, 2, 6]]      # 6 (20x20) - P5
  - [-1, 1, SPPF, [256, 5]]           # 7 (20x20)
  - [-1, 1, C2PSA, [256, 1]]          # 8 (20x20)

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 9 (40x40)
  - [[-1, 4], 1, Concat, [1]]                    # 10 Concat với P4 (Layer 4 là 40x40) -> KHỚP
  - [-1, 3, C3k2, [256, False]]                  # 11

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12 (80x80)
  - [[-1, 3], 1, Concat, [1]]                    # 13 Concat với P3 (Layer 3 là 80x80) -> KHỚP
  - [-1, 3, C3k2, [128, False]]                  # 14

  - [-1, 1, Conv, [128, 3, 2]]                   # 15 (40x40)
  - [[-1, 11], 1, Concat, [1]]                   # 16 Concat với Head P4 (Layer 11 là 40x40) -> KHỚP
  - [-1, 3, C3k2, [256, False]]                  # 17

  - [-1, 1, Conv, [256, 3, 2]]                   # 18 (20x20)
  - [[-1, 8], 1, Concat, [1]]                    # 19 Concat với Backbone P5 (Layer 8 là 20x20) -> KHỚP
  - [-1, 3, C3k2, [512, True]]                   # 20

  - [[14, 17, 20], 1, Detect, [nc]]              # 21