# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11-CBAM: Optimized for Natural/Texture Datasets (Apple Leaf)

# Parameters
nc: 80 # Sửa lại số class của bạn (ví dụ: 4)
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]             # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5-P4/16
  - [-1, 2, C3k2, [512, True]]            # 6
  - [-1, 1, Conv, [1024, 3, 2]]           # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 2, C2PSA, [1024]]                # 10

  # === THÊM CBAM VÀO CUỐI BACKBONE ===
  - [-1, 1, CBAM, [1024]]                 # 11 <--- Lọc đặc trưng P5

# YOLO11n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 6], 1, Concat, [1]]             # 13 (Cat với Backbone P4)
  - [-1, 2, C3k2, [512, False]]           # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, Concat, [1]]             # 16 (Cat với Backbone P3)
  - [-1, 2, C3k2, [256, False]]           # 17

  # === THÊM CBAM VÀO ĐẦU RA P3 ===
  - [-1, 1, CBAM, [256]]                  # 18 <--- Output P3 (Đã lọc)

  - [-1, 1, Conv, [256, 3, 2]]            # 19
  - [[-1, 14], 1, Concat, [1]]            # 20 (Cat với Layer 14)
  - [-1, 2, C3k2, [512, False]]           # 21

  # === THÊM CBAM VÀO ĐẦU RA P4 ===
  - [-1, 1, CBAM, [512]]                  # 22 <--- Output P4 (Đã lọc)

  - [-1, 1, Conv, [512, 3, 2]]            # 23
  - [[-1, 11], 1, Concat, [1]]            # 24 (Cat với Layer 11 - CBAM Backbone)
  - [-1, 2, C3k2, [1024, True]]           # 25

  # === THÊM CBAM VÀO ĐẦU RA P5 ===
  - [-1, 1, CBAM, [1024]]                 # 26 <--- Output P5 (Đã lọc)

  - [[18, 22, 26], 1, Detect, [nc]]       # Detect lấy từ các lớp CBAM