# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11-BiFPN-MHSA model
# Outputs: P3, P4, P5

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ---------------------------
# Backbone
# ---------------------------
backbone:
  - [-1, 1, Conv, [64, 3, 2]]            # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]           # 1 - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]    # 2 - P2 feature
  - [-1, 1, Conv, [256, 3, 2]]           # 3 - pre P3
  - [-1, 2, C3k2, [512, False, 0.25]]    # 4 - P3 output
  - [-1, 1, Conv, [512, 3, 2]]           # 5 - pre P4
  - [-1, 2, C3k2, [512, True]]           # 6 - P4 output
  - [-1, 1, Conv, [1024, 3, 2]]          # 7 - pre P5
  - [-1, 2, C3k2, [1024, True]]          # 8 - deeper P5
  - [-1, 1, SPPF, [1024, 5]]             # 9 - SPPF
  - [-1, 1, MHSA, [14, 4, 4]]            # 10 - MHSA on P5
  - [-1, 2, C2PSA, [1024]]               # 11 - P5 attention final

# ---------------------------
head:
  - [4, 1, Conv, [512]]                  # 12 <- P3 proj
  - [6, 1, Conv, [512]]                  # 13 <- P4 proj
  - [11, 1, Conv, [512]]                 # 14 <- P5 proj

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 15 P5->P4
  - [[-1, 13], 1, BiFPN, []]             # 16
  - [-1, 3, C3k2, [512]]                  # 17 P4'

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 18 P4'->P3
  - [[-1, 12], 1, BiFPN, []]             # 19
  - [-1, 3, C3k2, [512]]                  # 20 P3'

  - [1, 1, Conv, [512, 3, 2]]            # 21 P2->P3
  - [[-1, 12, 20], 1, BiFPN, []]         # 22
  - [-1, 3, C3k2, [256]]                  # 23 P3 final

  - [-1, 1, Conv, [512, 3, 2]]           # 24 P3->P4
  - [[-1, 13, 17], 1, BiFPN, []]         # 25
  - [-1, 3, C3k2, [512]]                  # 26 P4 final

  - [-1, 1, Conv, [512, 3, 2]]           # 27 P4->P5
  - [[-1, 14], 1, BiFPN, []]             # 28
  - [-1, 3, C3k2, [1024]]                 # 29 P5 final

  - [[23, 26, 29], 1, Detect, [nc]]      # Detect(P3, P4, P5)
