# Ultralytics YOLO 🚀, AGPL-3.0 license
# ═══════════════════════════════════════════════════════════════════════════
# YOLO-Spectra: Wavelet-Guided Directional Detection Architecture
# ═══════════════════════════════════════════════════════════════════════════
#
# Novel architecture with THREE original innovations:
#
#   1. Backbone: C3k2_Spectra (SpectraConv + WaveletEnergyGate)
#      → Haar wavelet decomposes features into 4 subbands (LL, LH, HL, HH)
#      → Orientation-matched asymmetric DWConv per subband
#      → Processing at HALF resolution → 4× cheaper DWConv
#      → Inverse Haar reconstructs full resolution losslessly
#
#   2. Neck: SpectraCSP (SpectraBottleneck with adaptive subband emphasis)
#      → Same wavelet-guided processing for consistent feature quality
#      → Learnable subband emphasis per pyramid level
#
#   3. Attention: WaveletEnergyGate
#      → 4 directional energy descriptors per channel
#      → Knows both frequency content AND edge orientation
#
# Key advantages vs YOLO11:
#   - ~30% fewer parameters (DWConv at half resolution)
#   - ~32% fewer GFLOPs (wavelet domain processing)
#   - Joint frequency-direction decomposition (vs none in baseline)

nc: 80
scales:
  # [depth_mul, width_mul, max_channels]
  n: [0.50, 0.25, 1024]    # Spectra-n: ~1.8M params
  s: [0.50, 0.50, 1024]    # Spectra-s: ~5M params
  m: [0.50, 1.00, 512]     # Spectra-m: ~12M params
  l: [1.00, 1.00, 512]     # Spectra-l: ~18M params
  x: [1.00, 1.50, 512]     # Spectra-x: ~30M params

backbone:
  # [from, repeats, module, args]

  # ── Stage 0: Stem ──
  - [-1, 1, Conv, [64, 3, 2]]                    # 0-P1/2   Standard stem

  # ── Stage 1: P1 → P2 ──
  - [-1, 1, Conv, [128, 3, 2]]                   # 1-P2/4   Downsample
  - [-1, 2, C3k2_Spectra, [256, False, 0.25]]    # 2-P2/4   Spectra blocks ×2

  # ── Stage 2: P2 → P3 (small objects) ──
  - [-1, 1, Conv, [256, 3, 2]]                   # 3-P3/8   Downsample
  - [-1, 2, C3k2_Spectra, [512, False, 0.25]]    # 4-P3/8   Spectra blocks ×2

  # ── Stage 3: P3 → P4 (medium objects) ──
  - [-1, 1, Conv, [512, 3, 2]]                   # 5-P4/16  Downsample
  - [-1, 2, C3k2_Spectra, [512, True]]           # 6-P4/16  Spectra blocks ×2

  # ── Stage 4: P4 → P5 (large objects) ──
  - [-1, 1, Conv, [1024, 3, 2]]                  # 7-P5/32  Downsample
  - [-1, 2, C3k2_Spectra, [1024, True]]          # 8-P5/32  Spectra blocks ×2
  - [-1, 1, SPPF, [1024, 5]]                     # 9-P5/32  Spatial Pyramid Pooling
  - [-1, 2, C2PSA, [1024]]                       # 10

head:
  # ════════════════════════ FPN: Top-Down ════════════════════════
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 11
  - [[-1, 6], 1, Concat, [1]]                         # 12 Concat with P4
  - [-1, 2, SpectraCSP, [512, False]]                 # 13 Spectra fusion (P4)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 14
  - [[-1, 4], 1, Concat, [1]]                         # 15 Concat with P3
  - [-1, 2, SpectraCSP, [256, False]]                 # 16 Spectra fusion (P3)

  # ════════════════════════ PAN: Bottom-Up ════════════════════════
  - [-1, 1, Conv, [256, 3, 2]]                        # 17 Downsample P3→P4
  - [[-1, 13], 1, Concat, [1]]                        # 18 Concat with FPN P4
  - [-1, 2, SpectraCSP, [512, False]]                 # 19 Spectra fusion (P4)

  - [-1, 1, Conv, [512, 3, 2]]                        # 20 Downsample P4→P5
  - [[-1, 10], 1, Concat, [1]]                        # 21 Concat with P5
  - [-1, 2, SpectraCSP, [1024, True]]                 # 22 Spectra fusion (P5)

  # ════════════════════════ Detection Head ════════════════════════
  - [[16, 19, 22], 1, Detect, [nc]]                   # 23 Detect(P3, P4, P5)
