# Ultralytics YOLO 🚀, AGPL-3.0 license
# ═══════════════════════════════════════════════════════════════════════════
# YOLO-Zenith: Wavelet-Topological Hybrid Detection Architecture
# ═══════════════════════════════════════════════════════════════════════════
#
# Novel architecture with THREE original innovations:
#
#   1. Backbone: C3k2_Zenith (WaveletConv + TopologicalGate)
#      → WaveletConv: 4-subband wavelet decomposition (LL, LH, HL, HH)
#        - LL: AvgPool → DWConv k×k (smooth approximation features)
#        - LH: horizontal gradient → DWConv 1×k (horizontal edges)
#        - HL: vertical gradient → DWConv k×1 (vertical edges)
#        - HH: Laplacian → DWConv 3×3 (diagonal detail, corners)
#        - Channels split into 4 groups, each processed in its sub-band
#        - Channel shuffle after merge for inter-subband info flow
#      → TopologicalGate: Euler-inspired peak-count channel attention
#        - Soft peak counting: fraction of positions above μ + α*σ
#        - Measures topological complexity (how many distinct peaks)
#        - Learnable per-channel threshold α
#        - Gate = FC(mean ∥ peak_ratio) → Sigmoid
#
#   2. Neck: ZenithCSP (ZenithBottleneck + AdaptiveScaleRouter)
#      → AdaptiveScaleRouter: Content-dependent multi-scale routing
#        - 3 scale paths: local(3×3), medium(AvgPool+3×3), global(AdaptivePool)
#        - Per-position routing weights via learned 1×1 conv → softmax
#        - Each position dynamically selects its optimal scale mix
#        - Residual connection for training stability
#
#   3. Head: Standard Detect (P3, P4, P5) — proven anchor-free detection
#
# Key advantages vs existing architectures:
#
#   vs YOLO11:
#   - 4-subband wavelet decomposition vs standard conv
#   - Topological + adaptive routing attention (none in C3k2)
#   - Content-dependent per-position receptive field
#
#   vs YOLO-Prism:
#   - 4 wavelet sub-bands (LL/LH/HL/HH) vs 2 frequency bands (lo/hi)
#   - Topological peak-count vs concentration L2/L1 ratio
#   - Adaptive scale routing vs dual-frequency spatial attention
#   - Captures directional info (H/V/D) that Prism's high-pass misses
#
#   vs YOLO-Nexus:
#   - Wavelet-decomposed sub-bands vs fixed directional kernel shapes
#   - Topology (peak count) vs sparsity (L1/L∞ ratio)
#   - Wavelet basis adapts via learned DWConv; Nexus shapes are fixed
#
#   vs YOLO-Chimera:
#   - Wavelet decomposition vs dilation-based scale
#   - Topology gate vs spectral gate (mean+std)
#   - Adaptive per-position routing vs static cross-scale modulation
#
# Hardware: Fully ONNX/TensorRT compatible (DWConv + 1×1 Conv + AvgPool, no exotic ops)
# Scaling: n/s/m/l/x via standard YOLO scaling system

nc: 80
scales:
  # [depth_mul, width_mul, max_channels]
  n: [0.50, 0.25, 1024]    # Zenith-n: ~1.2M params, edge deployment
  s: [0.50, 0.50, 1024]    # Zenith-s: ~3.5M params, balanced
  m: [0.50, 1.00, 512]     # Zenith-m: ~9.0M params, standard
  l: [1.00, 1.00, 512]     # Zenith-l: ~15M params, accurate
  x: [1.00, 1.50, 512]     # Zenith-x: ~25M params, maximum accuracy

backbone:
  # [from, repeats, module, args]
  # ── Stage 0: Stem ──
  - [-1, 1, Conv, [64, 3, 2]]                    # 0-P1/2   Standard stem Conv 3×3 stride 2
  # ── Stage 1: P1 → P2 ──
  - [-1, 1, Conv, [128, 3, 2]]                   # 1-P2/4   Downsample
  - [-1, 2, C3k2_Zenith, [128, False]]           # 2-P2/4   Zenith blocks ×2 (wavelet k=5)
  # ── Stage 2: P2 → P3 (small objects) ──
  - [-1, 1, Conv, [256, 3, 2]]                   # 3-P3/8   Downsample
  - [-1, 2, C3k2_Zenith, [256, False]]           # 4-P3/8   Zenith blocks ×2
  # ── Stage 3: P3 → P4 (medium objects) ──
  - [-1, 1, Conv, [512, 3, 2]]                   # 5-P4/16  Downsample
  - [-1, 2, C3k2_Zenith, [512, False]]           # 6-P4/16  Zenith blocks ×2
  # ── Stage 4: P4 → P5 (large objects) ──
  - [-1, 1, Conv, [1024, 3, 2]]                  # 7-P5/32  Downsample
  - [-1, 2, C3k2_Zenith, [1024, True]]           # 8-P5/32  Zenith blocks ×2 (c3k=True → wavelet k=7)
  - [-1, 1, SPPF, [1024, 5]]                     # 9-P5/32  Spatial Pyramid Pooling

head:
  # ════════════════════════ FPN: Top-Down Pathway ════════════════════════
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 10 Upsample P5→P4 size
  - [[-1, 6], 1, Concat, [1]]                         # 11 Concat with backbone P4
  - [-1, 2, ZenithCSP, [512, False]]                  # 12 Zenith fusion with ASR (P4)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]       # 13 Upsample P4→P3 size
  - [[-1, 4], 1, Concat, [1]]                         # 14 Concat with backbone P3
  - [-1, 3, ZenithCSP, [256, False]]                  # 15 Zenith fusion with ASR (P3) — 3 repeats for small obj

  # ════════════════════════ PAN: Bottom-Up Pathway ════════════════════════
  - [-1, 1, Conv, [256, 3, 2]]                        # 16 Downsample P3→P4
  - [[-1, 12], 1, Concat, [1]]                        # 17 Concat with FPN P4
  - [-1, 2, ZenithCSP, [512, False]]                  # 18 Zenith fusion with ASR (P4)

  - [-1, 1, Conv, [512, 3, 2]]                        # 19 Downsample P4→P5
  - [[-1, 9], 1, Concat, [1]]                         # 20 Concat with backbone P5 (SPPF)
  - [-1, 2, ZenithCSP, [1024, True]]                  # 21 Zenith fusion with ASR (P5) — c3k=True

  # ════════════════════════ Detection Head ════════════════════════
  - [[15, 18, 21], 1, Detect, [nc]]                   # 22 Detect(P3, P4, P5)
