# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 + MobileNetV4 Hybrid Lightweight Backbone (UIB + Mobile MQA)
# ====================================================================
# This hybrid variant uses MobileNetV4's MNV4Hybrid module (UIB + Mobile
# Multi-Query Attention) at P5. Since MQA already provides global attention,
# the redundant C2PSA module is removed to save parameters.
#
# Lightweight optimizations:
# - Expansion ratios reduced: 4→2 (early), 4→2 (P4), 6→3 (P5)
# - SE attention removed (se_ratio=0): saves ~15% params per UIB block
# - C2PSA removed: MQA in MNV4Hybrid already handles global context
# - Total: lighter than YOLO11 baseline with MQA global reasoning ability

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  # Stage 0: Stem
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  # Stage 1: Fused IB (expand=1) — lightweight basic features
  - [-1, 1, MNV4Conv, [64, 1, 1]]          # 1-P1/2
  # Stage 2: Fused IB (expand=2, stride=2) — lightweight P2
  - [-1, 2, MNV4Conv, [128, 2, 2]]         # 2-P2/4
  # Stage 3: Fused IB (expand=2, stride=2) — lightweight P3
  - [-1, 2, MNV4Conv, [256, 2, 2]]         # 3-P3/8
  # Stage 4: UIB Extra-DW (expand=2, stride=2) — P4, no SE
  - [-1, 2, MNV4UIB, [512, 2, 2]]          # 4-P4/16
  # Stage 5: UIB Extra-DW (expand=2, stride=1) — deeper P4, no SE
  - [-1, 2, MNV4UIB, [512, 1, 2]]          # 5-P4/16
  # Stage 6: UIB + MQA Hybrid (expand=3, stride=2) — P5 with global attention, no SE
  - [-1, 2, MNV4Hybrid, [1024, 2, 3]]      # 6-P5/32
  # SPPF for global context aggregation
  - [-1, 1, SPPF, [1024, 5]]               # 7-P5/32
  # No C2PSA — MQA in MNV4Hybrid already provides global attention

head:
  # -------- Top-down pathway (FPN) --------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 8 (P4/16)
  - [[-1, 5], 1, Concat, [1]]                   # 9 cat backbone P4 (Layer 5)
  - [-1, 2, C3k2, [512, False]]                 # 10 (P4-medium)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11 (P3/8)
  - [[-1, 3], 1, Concat, [1]]                   # 12 cat backbone P3 (Layer 3)
  - [-1, 2, C3k2, [256, False]]                 # 13 (P3-small)

  # -------- Bottom-up pathway (PAN) --------
  - [-1, 1, Conv, [256, 3, 2]]                  # 14 (P4/16)
  - [[-1, 10], 1, Concat, [1]]                  # 15 cat head P4
  - [-1, 2, C3k2, [512, False]]                 # 16 (P4-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 17 (P5/32)
  - [[-1, 7], 1, Concat, [1]]                   # 18 cat backbone P5 (SPPF)
  - [-1, 2, C3k2, [1024, True]]                 # 19 (P5-large)

  # Detect heads at P3, P4, P5
  - [[13, 16, 19], 1, Detect, [nc]]             # 20 Detect(P3, P4, P5)
