# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 + MobileNetV4 Lightweight Backbone
# ==========================================
# MobileNetV4 key innovations (kept):
# - Universal Inverted Bottleneck (UIB): Unified block with optional DW convs
# - Extra-DW Pattern: DW before AND after expansion for multi-scale spatial features
# - LayerScale + cosine stochastic depth for training stability
#
# Lightweight optimizations vs original MobileNetV4:
# - Expansion ratios reduced: 4→2 (early), 4→2 (P4), 6→3 (P5)
# - SE attention removed (se_ratio=0): saves ~15% params per UIB block
# - Fewer repeated blocks at P4 to reduce backbone cost
# - Total: lighter than YOLO11 baseline while keeping MNV4 architectural advantages

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  # Stage 0: Stem — standard Conv for initial feature extraction
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  # Stage 1: Fused IB (expand=1) — lightweight basic features
  - [-1, 1, MNV4Conv, [64, 1, 1]]          # 1-P1/2
  # Stage 2: Fused IB (expand=2, stride=2) — lightweight P2
  - [-1, 2, MNV4Conv, [128, 2, 2]]         # 2-P2/4
  # Stage 3: Fused IB (expand=2, stride=2) — lightweight P3 features
  - [-1, 2, MNV4Conv, [256, 2, 2]]         # 3-P3/8
  # Stage 4: UIB Extra-DW (expand=2, stride=2) — P4 with dual spatial processing, no SE
  - [-1, 2, MNV4UIB, [512, 2, 2]]          # 4-P4/16
  # Stage 5: UIB Extra-DW (expand=2, stride=1) — deeper P4 features, no SE
  - [-1, 2, MNV4UIB, [512, 1, 2]]          # 5-P4/16
  # Stage 6: UIB Extra-DW (expand=3, stride=2) — P5 high-level features, no SE
  - [-1, 2, MNV4UIB, [1024, 2, 3]]         # 6-P5/32
  # SPPF for global context aggregation
  - [-1, 1, SPPF, [1024, 5]]               # 7-P5/32
  # C2PSA for enhanced spatial attention at P5
  - [-1, 2, C2PSA, [1024]]                 # 8-P5/32

head:
  # -------- Top-down pathway (FPN) --------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 9 (P4/16)
  - [[-1, 5], 1, Concat, [1]]                   # 10 cat backbone P4 (Layer 5)
  - [-1, 2, C3k2, [512, False]]                 # 11 (P4-medium)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12 (P3/8)
  - [[-1, 3], 1, Concat, [1]]                   # 13 cat backbone P3 (Layer 3)
  - [-1, 2, C3k2, [256, False]]                 # 14 (P3-small)

  # -------- Bottom-up pathway (PAN) --------
  - [-1, 1, Conv, [256, 3, 2]]                  # 15 (P4/16)
  - [[-1, 11], 1, Concat, [1]]                  # 16 cat head P4
  - [-1, 2, C3k2, [512, False]]                 # 17 (P4-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 18 (P5/32)
  - [[-1, 8], 1, Concat, [1]]                   # 19 cat backbone P5 (C2PSA)
  - [-1, 2, C3k2, [1024, True]]                 # 20 (P5-large)

  # Detect heads at P3, P4, P5
  - [[14, 17, 20], 1, Detect, [nc]]             # 21 Detect(P3, P4, P5)
