# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 + Mobile-Former Hybrid Backbone
# =========================================
# Mobile-Former key innovations:
# - Bidirectional bridge between MobileNet (local) and Transformer (global)
# - Mobile branch: lightweight depthwise separable convolutions
# - Former branch: small set of learnable global tokens (M<<HW)
# - Mobile→Former: spatial features enrich global tokens via cross-attention
# - Former→Mobile: global context enhances local features via cross-attention
# - Best of both worlds: local detail + global reasoning
#
# This config: Conv stem (P1-P2) + Mobile-Former (P3-P5)
# Provides rich local-global feature interaction at every stage

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  # Stage 0: Conv stem — efficient low-level features
  - [-1, 1, Conv, [64, 3, 2]]                    # 0-P1/2
  # Stage 1: Conv for P2
  - [-1, 1, Conv, [128, 3, 2]]                   # 1-P2/4
  # Stage 2: C3k2 at P2 for local features
  - [-1, 2, C3k2, [256, False, 0.25]]            # 2-P2/4
  # Stage 3: Mobile-Former P3 (stride=2, bidirectional bridge)
  - [-1, 2, MobileFormerStage, [256, 2]]          # 3-P3/8
  # Stage 4: Mobile-Former P4 (stride=2, deeper features)
  - [-1, 3, MobileFormerStage, [512, 2]]          # 4-P4/16
  # Stage 5: Mobile-Former P4 (stride=1, more local-global interaction)
  - [-1, 2, MobileFormerStage, [512, 1]]          # 5-P4/16
  # Stage 6: Mobile-Former P5 (stride=2, highest-level features)
  - [-1, 2, MobileFormerStage, [1024, 2]]         # 6-P5/32
  # SPPF for global context aggregation
  - [-1, 1, SPPF, [1024, 5]]                      # 7-P5/32
  # C2PSA for enhanced spatial attention at P5
  - [-1, 2, C2PSA, [1024]]                        # 8-P5/32

head:
  # -------- Top-down pathway (FPN) --------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 9 (P4/16)
  - [[-1, 5], 1, Concat, [1]]                   # 10 cat backbone P4 (Layer 5)
  - [-1, 2, C3k2, [512, False]]                 # 11 (P4-medium)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12 (P3/8)
  - [[-1, 3], 1, Concat, [1]]                   # 13 cat backbone P3 (Layer 3)
  - [-1, 3, C3k2, [256, False]]                 # 14 (P3-small)

  # -------- Bottom-up pathway (PAN) --------
  - [-1, 1, Conv, [256, 3, 2]]                  # 15 (P4/16)
  - [[-1, 11], 1, Concat, [1]]                  # 16 cat head P4
  - [-1, 2, C3k2, [512, False]]                 # 17 (P4-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 18 (P5/32)
  - [[-1, 8], 1, Concat, [1]]                   # 19 cat backbone P5 (C2PSA)
  - [-1, 2, C3k2, [1024, True]]                 # 20 (P5-large)

  # Detect heads at P3, P4, P5
  - [[14, 17, 20], 1, Detect, [nc]]             # 21 Detect(P3, P4, P5)
