# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 + ViT (Vision Transformer) Backbone lai ghép
# ===================================================
# Các đặc điểm chính của ViT Hybrid:
# - Conv stem để trích xuất đặc trưng cấp thấp một cách mạnh mẽ
# - Multi-head self-attention tiêu chuẩn để nắm bắt ngữ cảnh toàn cục
# - Trường tiếp nhận toàn cục đầy đủ từ mỗi khối ViT
# - Positional embeddings 2D có thể học được để nhận biết không gian
#
# Cấu hình này: Conv stem (P1-P2) + các khối ViT (P3-P5)
# Conv stem bảo toàn cấu trúc không gian cục bộ
# ViT cung cấp cơ chế attention toàn cục không hạn chế ở các tầng sâu hơn

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  # [from, repeats, module, args]
  # Tầng 0: Conv stem — đặc trưng cấp thấp hiệu quả
  - [-1, 1, Conv, [64, 3, 2]]              # 0-P1/2
  # Tầng 1: Conv cho P2
  - [-1, 1, Conv, [128, 3, 2]]             # 1-P2/4
  # Tầng 2: C3k2 tại P2 cho các đặc trưng cục bộ
  - [-1, 2, C3k2, [256, False, 0.25]]      # 2-P2/4
  # Tầng 3: ViT hybrid P3 (stride=2, attention toàn cục)
  - [-1, 2, ViTStage, [256, 2]]            # 3-P3/8
  # Tầng 4: ViT hybrid P4 (stride=2, đặc trưng toàn cục sâu hơn)
  - [-1, 3, ViTStage, [512, 2]]            # 4-P4/16
  # Tầng 5: ViT hybrid P4 (stride=1, bổ sung attention toàn cục)
  - [-1, 2, ViTStage, [512, 1]]            # 5-P4/16
  # Tầng 6: ViT hybrid P5 (stride=2, đặc trưng toàn cục cấp cao nhất)
  - [-1, 2, ViTStage, [1024, 2]]           # 6-P5/32
  # SPPF để tổng hợp ngữ cảnh toàn cục
  - [-1, 1, SPPF, [1024, 5]]               # 7-P5/32
  # C2PSA để tăng cường spatial attention tại P5
  - [-1, 2, C2PSA, [1024]]                 # 8-P5/32

head:
  # -------- Đường truyền từ trên xuống (FPN) --------
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 9 (P4/16)
  - [[-1, 5], 1, Concat, [1]]                   # 10 nối với backbone P4 (Tầng 5)
  - [-1, 2, C3k2, [512, False]]                 # 11 (P4-medium)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 12 (P3/8)
  - [[-1, 3], 1, Concat, [1]]                   # 13 nối với backbone P3 (Tầng 3)
  - [-1, 3, C3k2, [256, False]]                 # 14 (P3-small)

  # -------- Đường truyền từ dưới lên (PAN) --------
  - [-1, 1, Conv, [256, 3, 2]]                  # 15 (P4/16)
  - [[-1, 11], 1, Concat, [1]]                  # 16 nối với head P4
  - [-1, 2, C3k2, [512, False]]                 # 17 (P4-medium)

  - [-1, 1, Conv, [512, 3, 2]]                  # 18 (P5/32)
  - [[-1, 8], 1, Concat, [1]]                   # 19 nối với backbone P5 (C2PSA)
  - [-1, 2, C3k2, [1024, True]]                 # 20 (P5-large)

  # Các head Detect tại P3, P4, P5
  - [[14, 17, 20], 1, Detect, [nc]]             # 21 Detect(P3, P4, P5)