# Ultralytics YOLO 🚀, AGPL-3.0
# YOLO12 ULTIMATE ECA: C2PSA + BiFPN + P2 Loop + Full ECA

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# =============================================================================
# BACKBONE (SPPF + C2PSA + ECA)
# =============================================================================
backbone:
  - [-1, 1, Conv, [64, 3, 2]]             # 0
  - [-1, 1, Conv, [128, 3, 2]]            # 1
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5
  - [-1, 2, C3k2, [512, True]]            # 6
  - [-1, 1, Conv, [1024, 3, 2]]           # 7
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9

  # ✅ Đã khôi phục C2PSA (Quan trọng cho Spatial Attention)
  - [-1, 1, C2PSA, [1024]]                # 10

  # ⚡ Thêm ECA nối tiếp để lọc kênh lần cuối (Double Attention)
  - [-1, 1, ECA, []]                      # 11 (Output Backbone P5)

# =============================================================================
# HEAD (Indices shifted by +1)
# =============================================================================
head:
  # --- Top-down Path ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 6], 1, BiFPN, [256]]                   # 13 (Nối P4 Backbone)
  - [-1, 2, C3k2, [256, False]]                  # 14 (P4 Top-down)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15
  - [[-1, 4], 1, BiFPN, [256]]                   # 16 (Nối P3 Backbone)
  - [-1, 2, C3k2, [256, False]]                  # 17
  - [-1, 1, ECA, []]                             # 18 (ECA P3 Top-down)

  # --- P2 Loop ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 19
  - [[-1, 2], 1, BiFPN, [256]]                   # 20 (Nối P2 Backbone)
  - [-1, 3, C3k2, [128, False]]                  # 21
  - [-1, 1, ECA, []]                             # 22 (ECA P2 Output)

  # --- Bottom-up Path ---

  # --- P3 Output ---
  - [-1, 1, Conv, [256, 3, 2]]                   # 23
  # Input BiFPN: [-1, 4, 18] (4=Backbone, 18=Top-down ECA)
  - [[-1, 4, 18], 1, BiFPN, [256]]               # 24
  - [-1, 4, C3k2, [256, False]]                  # 25
  - [-1, 1, ECA, []]                             # 26 (ECA Final P3)

  # --- P4 Output ---
  - [-1, 1, Conv, [256, 3, 2]]                   # 27
  # Input BiFPN: [-1, 6, 14] (6=Backbone, 14=Top-down)
  - [[-1, 6, 14], 1, BiFPN, [256]]               # 28
  - [-1, 4, C3k2, [512, False]]                  # 29
  - [-1, 1, ECA, []]                             # 30 (ECA Final P4)

  # --- P5 Output ---
  - [-1, 1, Conv, [256, 3, 2]]                   # 31
  # Input BiFPN: [-1, 11] (Nối vào ECA layer 11 - Cuối Backbone)
  - [[-1, 11], 1, BiFPN, [512]]                  # 32
  - [-1, 2, C3k2, [1024, True]]                  # 33
  - [-1, 1, ECA, []]                             # 34 (ECA Final P5)

  # Detect
  # Input: 26(P3), 30(P4), 34(P5)
  - [[26, 30, 34], 1, Detect, [nc]]