# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs.

# Parameters
nc: 80
scales:
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# ---------------------------
# Backbone
# ---------------------------
backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0 - P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1 - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3 - P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]         # 5 - P4/16
  - [-1, 2, C3k2, [512, True]]         # 6
  - [-1, 1, Conv, [1024, 3, 2]]        # 7 - P5/32
  - [-1, 2, C3k2, [1024, True]]        # 8
  - [-1, 1, SPPF, [1024, 5]]           # 9
  - [-1, 2, C2PSA, [1024]]             # 10
#  - [-1, 1, ECA, [1024]]                   # 11 (P5 bottleneck + attention)
#  - [-1, 1, CBAM, [1024]]  # 11
#  - [-1, 1, SimAM, [1024]]
  - [-1, 1, ECA, []]  # 11
#  - [-1, 1, GAM, []]  # 11
#  - [-1, 1, CoordAtt, []]  # 11
#  - [ -1, 1, TripletAttention, [] ] # 11
#  - [ -1, 1, ECA, [ 1024 ] ] # 11
#  - [ -1, 1, ShuffleAttention, [ 16, 8 ] ] # 11
#  - [ -1, 1, EMA, [ 1024,8 ] ] # 10

# ---------------------------
# Head (P3, P4, P5)
# ---------------------------
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [[-1, 6], 1, Concat, [1]]                  # 13: up(P5) + P4
  - [-1, 2, C3k2, [512, False]]                # 14: P4 head

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, Concat, [1]]                  # 16: up(P4) + P3
  - [-1, 2, C3k2, [256, False]]                # 17: P3 head  (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                 # 18: down to P4 scale
  - [[-1, 14], 1, Concat, [1]]                 # 19: + P4 head feat (index 14)
  - [-1, 2, C3k2, [512, False]]                # 20: P4 head  (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                 # 21: down to P5 scale
  - [[-1, 11], 1, Concat, [1]]                 # 22: + P5 bottleneck (index 11)
  - [-1, 2, C3k2, [1024, True]]                # 23: P5 head  (P5/32-large)

  - [[17, 20, 23], 1, Detect, [nc]]            # 24: Detect(P3, P4, P5)
