# Ultralytics YOLO 🚀, AGPL-3.0
# YOLO11-BiFPN + C2PSA (Backbone Only)
# No TripletAttention, No CoordAtt

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# =========================
# Backbone (SPPF + C2PSA)
# =========================
backbone:
  - [-1, 1, Conv, [64, 3, 2]]             # 0
  - [-1, 1, Conv, [128, 3, 2]]            # 1
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5
  - [-1, 2, C3k2, [512, True]]            # 6
  - [-1, 1, Conv, [1024, 3, 2]]           # 7
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9
  - [-1, 1, C2PSA, [1024]]                # 10

# =========================
# Head (BiFPN only)
# =========================
head:
  # === Top-down ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11
  - [[-1, 6], 1, BiFPN, [256]]                   # 12 (P4)
  - [-1, 2, C3k2, [256, False]]                  # 13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14
  - [[-1, 4], 1, BiFPN, [256]]                   # 15 (P3)
  - [-1, 2, C3k2, [256, False]]                  # 16

  # === P2 Loop ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 17
  - [[-1, 2], 1, BiFPN, [256]]                   # 18 (P2)
  - [-1, 2, C3k2, [128, False]]                  # 19

  # === Bottom-up ===
  # P3
  - [-1, 1, Conv, [256, 3, 2]]                   # 20
  - [[-1, 4, 16], 1, BiFPN, [256]]               # 21
  - [-1, 3, C3k2, [256, False]]                  # 22 -> Detect P3

  # P4
  - [-1, 1, Conv, [256, 3, 2]]                   # 23
  - [[-1, 6, 13], 1, BiFPN, [256]]               # 24
  - [-1, 3, C3k2, [512, False]]                  # 25 -> Detect P4

  # P5
  - [-1, 1, Conv, [256, 3, 2]]                   # 26
  - [[-1, 10], 1, BiFPN, [512]]                  # 27
  - [-1, 2, C3k2, [1024, True]]                  # 28 -> Detect P5

  # Detect
  - [[22, 25, 28], 1, Detect, [nc]]
