# Ultralytics YOLO 🚀, AGPL-3.0
# YOLO12 RAW POWER V2 + CBAM (Backbone Only)
# Backbone: C2PSA + CBAM
# Neck: BiFPN + P2 Loop
# Head: Pure Convolution (NO attention)

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# =========================
# Backbone (SPPF + C2PSA + CBAM)
# =========================
backbone:
  - [-1, 1, Conv, [64, 3, 2]]             # 0
  - [-1, 1, Conv, [128, 3, 2]]            # 1
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2 - P2/4
  - [-1, 1, Conv, [256, 3, 2]]            # 3
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4 - P3/8
  - [-1, 1, Conv, [512, 3, 2]]            # 5
  - [-1, 2, C3k2, [512, True]]            # 6 - P4/16
  - [-1, 1, Conv, [1024, 3, 2]]           # 7
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9

  # 🔥 Context Modeling (Backbone end)
  - [-1, 1, C2PSA, [1024]]                # 10
  - [-1, 1, CBAM, [1024]]                 # 11 ✅ ONLY CBAM (Backbone)

# =========================
# Head (BiFPN + P2 Loop, Pure Conv)
# =========================
head:
  # === Top-down Path ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 6], 1, BiFPN, [256]]                   # 13 (P4)
  - [-1, 2, C3k2, [256, False]]                  # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15
  - [[-1, 4], 1, BiFPN, [256]]                   # 16 (P3)
  - [-1, 2, C3k2, [256, False]]                  # 17

  # === P2 Loop ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 18
  - [[-1, 2], 1, BiFPN, [256]]                   # 19 (P2)
  - [-1, 3, C3k2, [128, False]]                  # 20

  # === Bottom-up Path ===
  # P3
  - [-1, 1, Conv, [256, 3, 2]]                   # 21
  - [[-1, 4, 17], 1, BiFPN, [256]]               # 22
  - [-1, 4, C3k2, [256, False]]                  # 23

  # P4
  - [-1, 1, Conv, [256, 3, 2]]                   # 24
  - [[-1, 6, 14], 1, BiFPN, [256]]               # 25
  - [-1, 4, C3k2, [512, False]]                  # 26

  # P5
  - [-1, 1, Conv, [256, 3, 2]]                   # 27
  - [[-1, 11], 1, BiFPN, [512]]                  # 28  # 🔥 dùng output CBAM backbone
  - [-1, 2, C3k2, [1024, True]]                  # 29

  # Detect
  - [[23, 26, 29], 1, Detect, [nc]]
