# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 BALANCED + MHSA Backbone + BiFPN + P2 Injection

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]             # 0 P1/2
  - [-1, 1, Conv, [128, 3, 2]]            # 1 P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2 P2/4
  - [-1, 1, Conv, [256, 3, 2]]            # 3 P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4 P3/8
  - [-1, 1, Conv, [512, 3, 2]]            # 5 P4/16
  - [-1, 2, C3k2, [512, True]]            # 6 P4/16
  - [-1, 1, Conv, [1024, 3, 2]]           # 7 P5/32
  - [-1, 2, C3k2, [1024, True]]           # 8 P5/32
  - [-1, 1, SPPF, [1024, 5]]              # 9 P5/32
  - [-1, 2, C2PSA, [1024]]                # 10 P5/32

  # EMA (Global Context)
  - [ -1, 1, EMA, [ 1024,8 ] ]              # 11 P5/32 (EMA)

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 6], 1, BiFPN, [256]]                   # 13 P4/16
  - [-1, 2, C3k2, [256, False]]                  # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15
  - [[-1, 4], 1, BiFPN, [256]]                   # 16 P3/8
  - [-1, 2, C3k2, [256, False]]                  # 17

  - [1, 1, Conv, [256, 3, 2]]                    # 18 P3/8 (from P2)
  - [[-1, 4, 17], 1, BiFPN, [256]]               # 19 P3/8
  - [-1, 2, C3k2, [256, False]]                  # 20

  - [-1, 1, Conv, [256, 3, 2]]                   # 21
  - [[-1, 6, 14], 1, BiFPN, [256]]               # 22 P4/16
  - [-1, 2, C3k2, [256, False]]                  # 23

  - [-1, 1, Conv, [512, 3, 2]]                   # 24
  - [[-1, 11], 1, BiFPN, [512]]                  # 25 P5/32 (Input từ MHSA)
  - [-1, 2, C3k2, [512, True]]                   # 26

  - [[20, 23, 26], 1, Detect, [nc]]              # 27 Detect(P3, P4, P5)