# Ultralytics YOLO 🚀, AGPL-3.0
# YOLO12 CBAM-ULTIMATE: C2PSA Backbone + BiFPN + P2 Loop + Full CBAM Head

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# =============================================================================
# BACKBONE (C2PSA Restored + CBAM Integrated)
# =============================================================================
backbone:
  - [-1, 1, Conv, [64, 3, 2]]             # 0
  - [-1, 1, Conv, [128, 3, 2]]            # 1
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5
  - [-1, 2, C3k2, [512, True]]            # 6
  - [-1, 1, Conv, [1024, 3, 2]]           # 7
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9

  # ✅ BỔ SUNG C2PSA (Theo yêu cầu)
  - [-1, 1, C2PSA, [1024]]                # 10

  # 🔄 Thay ECA bằng CBAM (Cuối Backbone)
  - [-1, 1, CBAM, [1024]]                 # 11 (Output Backbone P5)

# =============================================================================
# HEAD (BiFPN + Full CBAM - Index Shifted +1 due to C2PSA)
# =============================================================================
head:
  # === Top-down Path ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 6], 1, BiFPN, [256]]                   # 13 (Nối P4 Backbone)
  - [-1, 2, C3k2, [256, False]]                  # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15
  - [[-1, 4], 1, BiFPN, [256]]                   # 16 (Nối P3 Backbone)
  - [-1, 2, C3k2, [256, False]]                  # 17

  # 🔄 Thay ECA bằng CBAM (P3 Top-down)
  - [-1, 1, CBAM, [256]]                         # 18

  # === P2 Loop ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 19
  - [[-1, 2], 1, BiFPN, [256]]                   # 20 (Nối P2 Backbone)
  - [-1, 3, C3k2, [128, False]]                  # 21

  # 🔄 Thay ECA bằng CBAM (P2 Output)
  - [-1, 1, CBAM, [128]]                         # 22

  # === Bottom-up Path ===

  # --- P3 Output ---
  - [-1, 1, Conv, [256, 3, 2]]                   # 23
  # Input BiFPN: [-1, 4, 18] (4=Backbone P3, 18=CBAM Top-down P3)
  - [[-1, 4, 18], 1, BiFPN, [256]]               # 24
  - [-1, 4, C3k2, [256, False]]                  # 25

  # 🔄 Thay ECA bằng CBAM (P3 Final)
  - [-1, 1, CBAM, [256]]                         # 26 -> Ready P3

  # --- P4 Output ---
  - [-1, 1, Conv, [256, 3, 2]]                   # 27
  # Input BiFPN: [-1, 6, 14] (6=Backbone P4, 14=P4 Top-down)
  - [[-1, 6, 14], 1, BiFPN, [256]]               # 28
  - [-1, 4, C3k2, [512, False]]                  # 29

  # 🔄 Thay ECA bằng CBAM (P4 Final)
  - [-1, 1, CBAM, [512]]                         # 30 -> Ready P4

  # --- P5 Output ---
  - [-1, 1, Conv, [256, 3, 2]]                   # 31
  # Input BiFPN: [-1, 11] (Nối vào Layer 11 - CBAM Backbone)
  - [[-1, 11], 1, BiFPN, [512]]                  # 32
  - [-1, 2, C3k2, [1024, True]]                  # 33

  # 🔄 Thay ECA bằng CBAM (P5 Final)
  - [-1, 1, CBAM, [1024]]                        # 34 -> Ready P5

  # Detect
  # Input update: [26, 30, 34] (Các lớp CBAM cuối cùng)
  - [[26, 30, 34], 1, Detect, [nc]]