# Ultralytics YOLO 🚀, AGPL-3.0
# YOLO11-BiFPN (No Attention)
# Removed: TripletAttention + CoordAtt

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# =========================
# Backbone
# =========================
backbone:
  - [-1, 1, Conv, [64, 3, 2]]             # 0
  - [-1, 1, Conv, [128, 3, 2]]            # 1
  - [-1, 2, C3k2, [256, False, 0.25]]     # 2
  - [-1, 1, Conv, [256, 3, 2]]            # 3
  - [-1, 2, C3k2, [512, False, 0.25]]     # 4
  - [-1, 1, Conv, [512, 3, 2]]            # 5
  - [-1, 2, C3k2, [512, True]]            # 6
  - [-1, 1, Conv, [1024, 3, 2]]           # 7
  - [-1, 2, C3k2, [1024, True]]           # 8
  - [-1, 1, SPPF, [1024, 5]]              # 9

# =========================
# Head (BiFPN only)
# =========================
head:
  # === Top-down ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 10
  - [[-1, 6], 1, BiFPN, [256]]                   # 11 (P4)
  - [-1, 2, C3k2, [256, False]]                  # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 13
  - [[-1, 4], 1, BiFPN, [256]]                   # 14 (P3)
  - [-1, 2, C3k2, [256, False]]                  # 15

  # === P2 Loop ===
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 16
  - [[-1, 2], 1, BiFPN, [256]]                   # 17 (P2)
  - [-1, 3, C3k2, [128, False]]                  # 18

  # === Bottom-up ===
  # P3
  - [-1, 1, Conv, [256, 3, 2]]                   # 19
  - [[-1, 4, 15], 1, BiFPN, [256]]               # 20
  - [-1, 4, C3k2, [256, False]]                  # 21 -> Detect P3

  # P4
  - [-1, 1, Conv, [256, 3, 2]]                   # 22
  - [[-1, 6, 12], 1, BiFPN, [256]]               # 23
  - [-1, 4, C3k2, [512, False]]                  # 24 -> Detect P4

  # P5
  - [-1, 1, Conv, [256, 3, 2]]                   # 25
  - [[-1, 9], 1, BiFPN, [512]]                   # 26
  - [-1, 2, C3k2, [1024, True]]                  # 27 -> Detect P5

  # Detect
  - [[21, 24, 27], 1, Detect, [nc]]
